[
  {
    "url": "https://www.linkedin.com/jobs/view/software-engineer-professional-services-at-fireblocks-4107998267?lg=en",
    "job_posting_id": "4107998267",
    "job_title": "Software Engineer, Professional Services",
    "company_name": "Fireblocks",
    "company_id": "14824547",
    "job_location": "Tel Aviv District, Israel",
    "job_summary": "The world of digital assets is accelerating in speed, magnitude, and complexity, opening the door to new ways for leveraging the blockchain. Fireblocks’ platform and network provide the simplest and most secure way for companies to work with digital assets and it trusted by some of the largest financial institutions, banks, globally-recognized brands, and Web3 companies in the world, including BNY Mellon, BNP Paribas, ANZ Bank, Revolut, and thousands more. We are looking for a dynamic and driven Professional Services Engineer to join our team. In this role, you will work directly with our clients to design, implement, and deliver custom solutions that meet their unique requirements. You will act as a technical expert and bridge the gap between client needs and our product capabilities. What You'll Do Collaborate with clients to understand their technical requirements and design tailored solutions. Build and implement custom tools, integrations, and scripts to enhance client operations using Fireblocks’ platform. Work on both frontend and backend components to deliver end-to-end solutions. Assist clients in integrating with Fireblocks APIs and developing workflows for crypto and web3 operations. Provide technical training and guidance to clients, ensuring smooth adoption of custom solutions. Stay updated on the latest trends in blockchain, cryptocurrency, and decentralized technologies. What You'll Bring 2+ years of experience in software development. Proficiency in JavaScript, TypeScript, and Python. Strong understanding of frontend and backend technologies. Hands-on experience working with SQL and NoSQL databases. Familiarity with containerization and orchestration tools like Docker and Kubernetes. Knowledge of blockchain and crypto development, including smart contracts, web3 libraries, and wallet integrations. Understanding of security protocols and best practices in crypto and blockchain. Strong analytical and problem-solving skills with a client-centric mindset. Excellent communication and interpersonal skills for working with diverse clients. Nice to Have Experience with Fireblocks or similar crypto platforms. Knowledge of cloud platforms like AWS, GCP, or Azure. Fireblocks' mission is to enable every business to easily and securely access digital assets and cryptocurrencies. In order to do that, we strongly believe our workforce should be as diverse as our clients, and this is why we embrace diversity and inclusion in all its forms. Please see our candidate privacy policy here. Show more Show less",
    "job_seniority_level": "Entry level",
    "job_function": "Information Technology",
    "job_employment_type": "Full-time",
    "job_industries": "Software Development",
    "company_url": "https://www.linkedin.com/company/fireblocks?trk=public_jobs_topcard-org-name",
    "job_posted_time": "1 hour ago",
    "job_num_applicants": 25,
    "discovery_input": {
      "url": "https://www.linkedin.com/jobs/search?keywords=Software&location=Tel%20Aviv-Yafo&geoId=101570771&trk=public_jobs_jobs-search-bar_search-submit&position=1&pageNum=0&f_TPR=r3600"
    },
    "apply_link": "https://www.linkedin.com/jobs/view/externalApply/4107998267?url=https%3A%2F%2Fwww%2Efireblocks%2Ecom%2Fcareers%2Fcurrent-openings%2F4426623006%3Fgh_jid%3D4426623006&urlHash=AQr3",
    "country_code": null,
    "title_id": "7092",
    "company_logo": "https://media.licdn.com/dms/image/v2/C4D0BAQEyT6gpuwTpPg/company-logo_100_100/company-logo_100_100/0/1630561416766/fireblocks_logo?e=2147483647&v=beta&t=MNcf2cPIzbPMdPDbsidFZBlEVWQHcHK-QimzqSaimww",
    "job_posted_date": "2024-12-22T08:39:21.666Z",
    "job_poster": {
      "name": null,
      "title": null,
      "url": null
    },
    "application_availability": true,
    "job_description_formatted": "<section class=\"show-more-less-html\" data-max-lines=\"5\">\n        <div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          The world of digital assets is accelerating in speed, magnitude, and complexity, opening the door to new ways for leveraging the blockchain. Fireblocks&#x2019; platform and network provide the simplest and most secure way for companies to work with digital assets and it trusted by some of the largest financial institutions, banks, globally-recognized brands, and Web3 companies in the world, including BNY Mellon, BNP Paribas, ANZ Bank, Revolut, and thousands more.<br><br>We are looking for a dynamic and driven <strong>Professional Services Engineer</strong> to join our team.<br><br>In this role, you will work directly with our clients to design, implement, and deliver custom solutions that meet their unique requirements.<br><br>You will act as a technical expert and bridge the gap between client needs and our product capabilities.<br><br><strong>What You&apos;ll Do<br><br></strong><ul><li>Collaborate with clients to understand their technical requirements and design tailored solutions.</li><li>Build and implement custom tools, integrations, and scripts to enhance client operations using Fireblocks&#x2019; platform.</li><li>Work on both frontend and backend components to deliver end-to-end solutions.</li><li>Assist clients in integrating with Fireblocks APIs and developing workflows for crypto and web3 operations.</li><li>Provide technical training and guidance to clients, ensuring smooth adoption of custom solutions.</li><li>Stay updated on the latest trends in blockchain, cryptocurrency, and decentralized technologies.<br><br></li></ul><strong>What You&apos;ll Bring<br><br></strong><ul><li>2+ years of experience in software development.</li><li>Proficiency in JavaScript, TypeScript, and Python.</li><li>Strong understanding of frontend and backend technologies.</li><li>Hands-on experience working with SQL and NoSQL databases.</li><li>Familiarity with containerization and orchestration tools like Docker and Kubernetes.</li><li>Knowledge of blockchain and crypto development, including smart contracts, web3 libraries, and wallet integrations.</li><li>Understanding of security protocols and best practices in crypto and blockchain.</li><li>Strong analytical and problem-solving skills with a client-centric mindset.</li><li>Excellent communication and interpersonal skills for working with diverse clients.<br><br></li></ul><strong>Nice to Have<br><br></strong><ul><li>Experience with Fireblocks or similar crypto platforms.</li><li>Knowledge of cloud platforms like AWS, GCP, or Azure.<br><br></li></ul><em>Fireblocks&apos; mission is to enable every business to easily and securely access digital assets and cryptocurrencies. In order to do that, we strongly believe our workforce should be as diverse as our clients, and this is why we embrace diversity and inclusion in all its forms. <br><br></em><em>Please see our candidate privacy policy here.</em>\n        </div>\n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--more\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\" aria-label=\"i18n_show_more\" aria-expanded=\"false\">\n<!---->\n        \n            Show more\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/cyolgscd0imw2ldqppkrb84vo\"></icon>\n    </button>\n  \n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--less\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\" aria-label=\"i18n_show_less\" aria-expanded=\"true\">\n<!---->\n        \n            Show less\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/4chtt12k98xwnba1nimld2oyg\"></icon>\n    </button>\n  \n<!---->    </section>",
    "base_salary": {
      "min_amount": null,
      "max_amount": null,
      "currency": null,
      "payment_period": null
    },
    "timestamp": "2024-12-22T09:39:21.679Z",
    "input": {
      "url": "https://il.linkedin.com/jobs/view/software-engineer-professional-services-at-fireblocks-4107998267"
    }
  },
  {
    "url": "https://www.linkedin.com/jobs/view/technical-writer-50%25-position-at-tabnine-4108010312?lg=en",
    "job_posting_id": "4108010312",
    "job_title": "Technical Writer (50% Position)",
    "company_name": "Tabnine",
    "company_id": "3236936",
    "job_location": "Tel Aviv-Yafo, Tel Aviv District, Israel",
    "job_summary": "A bit about Tabnine: Since launching our first AI coding assistant in 2018, Tabnine has pioneered generative AI to elevate the coding experience for over 1M developers worldwide across thousands of companies. Our mission is to help development teams of every size speed up and simplify the software development process, with AI while maintaining the highest standards of privacy and security. Tabnine boosts engineering velocity, code quality, and developer happiness by automating the coding workflow through AI tools customized to their teams. Unlike generic coding assistants, Tabnine is the AI that you control. A bit about the job: We are looking for an experienced Technical Writer (50% Position) to join our Product team and help take our client-focused documentation to a new level. You will own the documentation for all product areas and have a direct impact on the company’s success. Responsibilities: Establish the technical writing profession at Tabnine. Collaborate effectively with global teams. Gather, analyze, and understand technical information, translating complex concepts into clear, engaging content. Plan, develop, write, and maintain technical manuals, knowledge base articles, release notes, API documentation, and online help. Requirements: 5+ years of professional experience in technical writing. Extensive experience creating technical documentation for enterprise software companies and complex software products. Native English language proficiency, including reading, writing, speaking, and copy editing. Deep understanding of AI and LLMs. Strong organizational skills and ability to manage multiple projects. M.Sc. or equivalent in a relevant technical field. Show more Show less",
    "job_seniority_level": "Mid-Senior level",
    "job_function": "Writing/Editing and Engineering",
    "job_employment_type": "Part-time",
    "job_industries": "Software Development",
    "company_url": "https://il.linkedin.com/company/tabnine?trk=public_jobs_topcard-org-name",
    "job_posted_time": "6 minutes ago",
    "job_num_applicants": 25,
    "discovery_input": {
      "url": "https://www.linkedin.com/jobs/search?keywords=Software&location=Tel%20Aviv-Yafo&geoId=101570771&trk=public_jobs_jobs-search-bar_search-submit&position=1&pageNum=0&f_TPR=r3600"
    },
    "apply_link": null,
    "country_code": null,
    "title_id": "206",
    "company_logo": "https://media.licdn.com/dms/image/v2/D4D0BAQG1DDRK670HYw/company-logo_100_100/company-logo_100_100/0/1714498808832/tabnine_logo?e=2147483647&v=beta&t=MKDjZnw79Yi0dIXISXaanYU1IZiXj5zRPNeQ3H94UjQ",
    "job_posted_date": "2024-12-22T09:33:24.741Z",
    "job_poster": {
      "name": null,
      "title": null,
      "url": null
    },
    "application_availability": true,
    "job_description_formatted": "<section class=\"show-more-less-html\" data-max-lines=\"5\">\n        <div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <p><strong>A bit about Tabnine:</strong></p><p>Since launching our first AI coding assistant in 2018, Tabnine has pioneered generative AI to elevate the coding experience for over 1M developers worldwide across thousands of companies. Our mission is to help development teams of every size speed up and simplify the software development process, with AI while maintaining the highest standards of privacy and security. Tabnine boosts engineering velocity, code quality, and developer happiness by automating the coding workflow through AI tools customized to their teams. Unlike generic coding assistants, Tabnine is the AI that <em>you</em> control.</p><p><br></p><p><strong>A bit about the job:</strong></p><p>We are looking for an experienced Technical Writer (50% Position) to join our Product team and help take our client-focused documentation to a new level. You will own the documentation for all product areas and have a direct impact on the company&#x2019;s success.</p><p><br></p><p><u>Responsibilities:</u></p><ul><li>Establish the technical writing profession at Tabnine.</li><li>Collaborate effectively with global teams.</li><li>Gather, analyze, and understand technical information, translating complex concepts into clear, engaging content.</li><li>Plan, develop, write, and maintain technical manuals, knowledge base articles, release notes, API documentation, and online help.</li></ul><p><br></p><p><u>Requirements:</u></p><ul><li>5+ years of professional experience in technical writing.</li><li>Extensive experience creating technical documentation for enterprise software companies and complex software products.</li><li>Native English language proficiency, including reading, writing, speaking, and copy editing.</li><li>Deep understanding of AI and LLMs.</li><li>Strong organizational skills and ability to manage multiple projects.</li><li>M.Sc. or equivalent in a relevant technical field.</li></ul><p></p>\n        </div>\n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--more\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\" aria-label=\"i18n_show_more\" aria-expanded=\"false\">\n<!---->\n        \n            Show more\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/cyolgscd0imw2ldqppkrb84vo\"></icon>\n    </button>\n  \n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--less\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\" aria-label=\"i18n_show_less\" aria-expanded=\"true\">\n<!---->\n        \n            Show less\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/4chtt12k98xwnba1nimld2oyg\"></icon>\n    </button>\n  \n<!---->    </section>",
    "base_salary": {
      "min_amount": null,
      "max_amount": null,
      "currency": null,
      "payment_period": null
    },
    "timestamp": "2024-12-22T09:39:24.759Z",
    "input": {
      "url": "https://il.linkedin.com/jobs/view/technical-writer-50%25-position-at-tabnine-4108010312"
    }
  },
  {
    "url": "https://www.linkedin.com/jobs/view/quality-assurance-specialist-at-visual-layer-4102709249?lg=en",
    "job_posting_id": "4102709249",
    "job_title": "Quality Assurance Specialist",
    "company_name": "Visual Layer",
    "company_id": "83498686",
    "job_location": "Tel Aviv District, Israel",
    "job_summary": "About the job Join our innovative R&D team at Visual Layer as a Quality Assurance Specialist! We are seeking a talented individual to ensure our platform’s excellence. You will develop, execute, and refine testing strategies to guarantee product quality, reliability, and security. Your work will directly impact high-stakes deployments, including defense and government collaborations. The ideal candidate is an exceptionally organized, methodical professional who has the experience necessary to take our products to the next level in accuracy, security, and safety. The specialist will be charged with developing a complete QA program that not only safeguards product quality but also fosters a culture in which all employees are actively engaged. Visual Layer is a dynamic startup dedicated to revolutionizing visual data management. We're building tools to help data scientists, data analysts, and developers efficiently manage, explore and curate large-scale image and video datasets. What you'll do: Plan, execute, and oversee product inspection and testing to ensure quality and conformance to specifications and deliverables. Collaborate with Engineering, Product, and Marketing teams to resolve issues and optimize product performance. Investigate product quality reports and ensure issues are resolved according to company guidelines and regulatory standards. Continuously enhance testing tools and processes to improve efficiency and effectiveness. Create technical content such as blog posts, tutorials, open-source projects, and documentation to assist developers in adopting Visual Layer’s tools, especially fastdup. Ensure consistency across the website and social media platforms. Requirements: 3+ years experience in QA for software or data platforms (Must). Experience with tools like JIRA and TestRail (Must). Saas and OnPrem experience (Must). A degree in Computer Science, Engineering, or a related field. Strong understanding of testing frameworks and methodologies. Knowledge of visual data systems is an advantage. Experience with white box and black box testing. Excellent analytical, problem-solving skills and attention to detail. Communication Skills. Demonstrated commitment, a proactive mindset, eagerness to learn, and a strong drive to contribute and succeed. Fluent in English. Certifications in QA (optional). Show more Show less",
    "job_seniority_level": "Mid-Senior level",
    "job_function": "Quality Assurance",
    "job_employment_type": "Full-time",
    "job_industries": "Data Infrastructure and Analytics",
    "company_url": "https://il.linkedin.com/company/visual-layer?trk=public_jobs_topcard-org-name",
    "job_posted_time": "35 minutes ago",
    "job_num_applicants": 55,
    "discovery_input": {
      "url": "https://www.linkedin.com/jobs/search?keywords=Software&location=Tel%20Aviv-Yafo&geoId=101570771&trk=public_jobs_jobs-search-bar_search-submit&position=1&pageNum=0&f_TPR=r3600"
    },
    "apply_link": null,
    "country_code": null,
    "title_id": "209",
    "company_logo": "https://media.licdn.com/dms/image/v2/D4D0BAQF8Iy-WDSv1zg/company-logo_100_100/company-logo_100_100/0/1680759612443/visual_layer_logo?e=2147483647&v=beta&t=knDodBsMETTP9v0UMkOacOtcMxv1Zp3v-lGFDd4S7_w",
    "job_posted_date": "2024-12-22T09:04:27.452Z",
    "job_poster": {
      "name": "Amir Alush",
      "title": "CTO and co-founder, driving innovation at Visual Layer",
      "url": "https://il.linkedin.com/in/amiralush"
    },
    "application_availability": true,
    "job_description_formatted": "<section class=\"show-more-less-html\" data-max-lines=\"5\">\n        <div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <strong>About the job</strong><p><span>Join our innovative R&amp;D team at Visual Layer as a Quality Assurance Specialist!</span></p><p><span>We are seeking a talented individual to ensure our platform&#x2019;s excellence. You will develop, execute, and refine testing strategies to guarantee product quality, reliability, and security. Your work will directly impact high-stakes deployments, including defense and government collaborations.</span></p><p><span>The ideal candidate is an exceptionally organized, methodical professional who has the experience necessary to take our products to the next level in accuracy, security, and safety. The specialist will be charged with developing a complete QA program that not only safeguards product quality but also fosters a culture in which all employees are actively engaged.</span></p><p><br></p><p><span>Visual Layer is a dynamic startup dedicated to revolutionizing visual data management. We&apos;re building tools to help data scientists, data analysts, and developers efficiently manage, explore and curate large-scale image and video datasets.</span></p><p><br></p><p><strong>What you&apos;ll do:</strong></p><ul><li><span>Plan, execute, and oversee product inspection and testing to ensure quality and conformance to specifications and deliverables.</span></li><li><span>Collaborate with Engineering, Product, and Marketing teams to resolve issues and optimize product performance.</span></li><li><span>Investigate product quality reports and ensure issues are resolved according to company guidelines and regulatory standards.</span></li><li><span>Continuously enhance testing tools and processes to improve efficiency and effectiveness. Create technical content such as blog posts, tutorials, open-source projects, and documentation to assist developers in adopting Visual Layer&#x2019;s tools, especially fastdup.</span></li><li><span>Ensure consistency across the website and social media platforms.</span></li></ul><p><br></p><p><strong>Requirements:</strong></p><ul><li><strong>3+ years experience in QA for software or data platforms (Must).</strong></li><li><strong>Experience with tools like JIRA and TestRail (Must).</strong></li><li><strong>Saas and OnPrem experience (Must).</strong></li><li><strong>A degree in Computer Science, Engineering, or a related field.</strong></li><li><span>Strong understanding of testing frameworks and methodologies.</span></li><li><span>Knowledge of visual data systems is an advantage.</span></li><li><span>Experience with white box and black box testing.</span></li><li><span>Excellent analytical, problem-solving skills and attention to detail.</span></li><li><span>Communication Skills.</span></li><li><span>Demonstrated commitment, a proactive mindset, eagerness to learn, and a strong drive to contribute and succeed.</span></li><li><span>Fluent in English.</span></li><li><span>Certifications in QA (optional).</span></li></ul><p><br></p>\n        </div>\n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--more\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\" aria-label=\"i18n_show_more\" aria-expanded=\"false\">\n<!---->\n        \n            Show more\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/cyolgscd0imw2ldqppkrb84vo\"></icon>\n    </button>\n  \n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--less\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\" aria-label=\"i18n_show_less\" aria-expanded=\"true\">\n<!---->\n        \n            Show less\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/4chtt12k98xwnba1nimld2oyg\"></icon>\n    </button>\n  \n<!---->    </section>",
    "base_salary": {
      "min_amount": null,
      "max_amount": null,
      "currency": null,
      "payment_period": null
    },
    "timestamp": "2024-12-22T09:39:27.469Z",
    "input": {
      "url": "https://il.linkedin.com/jobs/view/quality-assurance-specialist-at-visual-layer-4102709249"
    }
  },
  {
    "url": "https://www.linkedin.com/jobs/view/senior-software-engineer-at-tabnine-4108011241?lg=en",
    "job_posting_id": "4108011241",
    "job_title": "Senior Software Engineer",
    "company_name": "Tabnine",
    "company_id": "3236936",
    "job_location": "Tel Aviv-Yafo, Tel Aviv District, Israel",
    "job_summary": "A bit about us: Tabnine is a pioneering developer tooling company leveraging advanced generative AI to elevate the coding experience for over a million developers worldwide. With a sharp focus on natural language processing and machine learning, Tabnine empowers developers to code more efficiently and creatively. Join Tabnine on our mission to redefine software development through the power of AI. A bit about you: Are you a visionary software developer eager to shape the future of coding and have a global impact? Join Tabnine, where we're on a mission to revolutionize the developer experience with our real-world generative AI products. As a Software Developer, you will play a pivotal role in crafting cutting-edge solutions that empower over 1 million developers worldwide. Together, we'll unleash the potential of AI to make coding more efficient, creative, and enjoyable for developers everywhere. Join us at Tabnine and be a part of something extraordinary. Our solution tech. stack: B2B, B2C, SaaS, Self-hosting Backend services + web: Typescript (NodeJS + ReactJS) Client: Rust IDE plugins: Typescript (vscode), Java (IntelliJ, Eclipse), c# (visual studio) Postgres & Redis GCP, AWS Kubernetes Requirements: 6+ years of software engineering experience, preferably across a variety of languages, technologies and tools Experience in Node.js / TypeScript - Must Experience working on modern, high scale, production-grade projects Experience with databases (relational or NoSQL) Experience working with any cloud platform A decision-maker that takes analytics & data-guided actions A go-getter that needs very little guidance to “conquer the mountain” All-around team player, fast, self-learning individual B.Sc. or higher in Computer Science, Software Engineering, or a related field from a well-known university - Must! Nice to have: Experience working at an early-stage startup Experience with building for B2B on-prem Experience with DevOps Show more Show less",
    "job_seniority_level": "Mid-Senior level",
    "job_function": "Engineering",
    "job_employment_type": "Full-time",
    "job_industries": "Software Development",
    "company_url": "https://il.linkedin.com/company/tabnine?trk=public_jobs_topcard-org-name",
    "job_posted_time": "6 minutes ago",
    "job_num_applicants": 25,
    "discovery_input": {
      "url": "https://www.linkedin.com/jobs/search?keywords=Software&location=Tel%20Aviv-Yafo&geoId=101570771&trk=public_jobs_jobs-search-bar_search-submit&position=1&pageNum=0&f_TPR=r3600"
    },
    "apply_link": null,
    "country_code": null,
    "title_id": "9",
    "company_logo": "https://media.licdn.com/dms/image/v2/D4D0BAQG1DDRK670HYw/company-logo_100_100/company-logo_100_100/0/1714498808832/tabnine_logo?e=2147483647&v=beta&t=MKDjZnw79Yi0dIXISXaanYU1IZiXj5zRPNeQ3H94UjQ",
    "job_posted_date": "2024-12-22T09:33:31.109Z",
    "job_poster": {
      "name": null,
      "title": null,
      "url": null
    },
    "application_availability": true,
    "job_description_formatted": "<section class=\"show-more-less-html\" data-max-lines=\"5\">\n        <div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <p><strong>A bit about us:</strong></p><p>Tabnine is a pioneering developer tooling company leveraging advanced generative AI to elevate the coding experience for over a million developers worldwide. With a sharp focus on natural language processing and machine learning, Tabnine empowers developers to code more efficiently and creatively. Join Tabnine on our mission to redefine software development through the power of AI.</p><p><br></p><p><strong>A bit about you:</strong></p><p>Are you a visionary software developer eager to shape the future of coding and have a global impact? Join Tabnine, where we&apos;re on a mission to revolutionize the developer experience with our real-world generative AI products. As a Software Developer, you will play a pivotal role in crafting cutting-edge solutions that empower over 1 million developers worldwide. Together, we&apos;ll unleash the potential of AI to make coding more efficient, creative, and enjoyable for developers everywhere. Join us at Tabnine and be a part of something extraordinary.</p><p><br></p><p><strong>Our solution tech. stack:</strong></p><ul><li>B2B, B2C, SaaS, Self-hosting</li><li>Backend services + web: Typescript (NodeJS + ReactJS)</li><li>Client: Rust</li><li>IDE plugins: Typescript (vscode), Java (IntelliJ, Eclipse), c# (visual studio)</li><li>Postgres &amp; Redis</li><li>GCP, AWS</li><li>Kubernetes</li></ul><p><br></p><p><strong>Requirements:</strong></p><ul><li>6+ years of software engineering experience, preferably across a variety of languages, technologies and tools</li><li>Experience in Node.js / TypeScript - Must</li><li>Experience working on modern, high scale, production-grade projects</li><li>Experience with databases (relational or NoSQL)</li><li>Experience working with any cloud platform</li><li>A decision-maker that takes analytics &amp; data-guided actions</li><li>A go-getter that needs very little guidance to &#x201C;conquer the mountain&#x201D;</li><li>All-around team player, fast, self-learning individual</li><li>B.Sc. or higher in Computer Science, Software Engineering, or a related field from a well-known university - Must!</li></ul><p><br></p><p><strong>Nice to have:</strong></p><ul><li>Experience working at an early-stage startup</li><li>Experience with building for B2B on-prem</li><li>Experience with DevOps</li></ul>\n        </div>\n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--more\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\" aria-label=\"i18n_show_more\" aria-expanded=\"false\">\n<!---->\n        \n            Show more\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/cyolgscd0imw2ldqppkrb84vo\"></icon>\n    </button>\n  \n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--less\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\" aria-label=\"i18n_show_less\" aria-expanded=\"true\">\n<!---->\n        \n            Show less\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/4chtt12k98xwnba1nimld2oyg\"></icon>\n    </button>\n  \n<!---->    </section>",
    "base_salary": {
      "min_amount": null,
      "max_amount": null,
      "currency": null,
      "payment_period": null
    },
    "timestamp": "2024-12-22T09:39:31.132Z",
    "input": {
      "url": "https://il.linkedin.com/jobs/view/senior-software-engineer-at-tabnine-4108011241"
    }
  },
  {
    "url": "https://www.linkedin.com/jobs/view/assistant-financial-controller-at-magenta-medical-ltd-4107524493?lg=en",
    "job_posting_id": "4107524493",
    "job_title": "Assistant Financial Controller",
    "company_name": "Magenta Medical Ltd.",
    "company_id": "6366808",
    "job_location": "Center District, Israel",
    "job_summary": "About the Company - Magenta Medical is a medical device company developing the world’s smallest heart pump, meant to provide minimally-invasive support to the heart during acute episodes of dysfunction. The Elevate™ System is multi-disciplinary, involving mechanical engineering, material science, electrical engineering, software, algorithms, and state-of-the-art catheter fabrication techniques. We are seeking exceptional individuals to help drive the Elevate™ System forward and potentially save more lives About the Role We are looking for a highly skilled and motivated Assistant Controller to join our finance team and support the company’s financial operations. Reports to: Financial Controller Key Responsibilities Oversee payroll controllers in Israel and the US, as well as the overall payroll process. Support the bookkeeper and provide guidance on accounting matters. Ensure compliance with company policies and processes, including travel expenses and expense reimbursements. Assist in the preparation of quarterly and annual financial statements. Prepare the annual tax report and fulfill other statutory reporting requirements. Qualifications CPA post-internship with a minimum of 2 years of experience as an assistant controller – must. Fluency in English (both spoken and written) – must. Strong proficiency in Excel and the ability to quickly learn new software and systems – must. Familiarity with Priority and QuickBooks – preferred. Excellent communication skills and a team-oriented mindset. Strong analytical abilities, detail-oriented. Show more Show less",
    "job_seniority_level": "Associate",
    "job_function": "Finance",
    "job_employment_type": "Full-time",
    "job_industries": "Medical Device",
    "company_url": "https://il.linkedin.com/company/magenta-medical?trk=public_jobs_topcard-org-name",
    "job_posted_time": "1 hour ago",
    "job_num_applicants": 25,
    "discovery_input": {
      "url": "https://www.linkedin.com/jobs/search?keywords=Software&location=Tel%20Aviv-Yafo&geoId=101570771&trk=public_jobs_jobs-search-bar_search-submit&position=1&pageNum=0&f_TPR=r3600"
    },
    "apply_link": null,
    "country_code": null,
    "title_id": "192",
    "company_logo": "https://media.licdn.com/dms/image/v2/D4D0BAQHF-aD7H9pSfQ/company-logo_100_100/company-logo_100_100/0/1727266535245/magenta_medical_logo?e=2147483647&v=beta&t=AKrvKVBHHnx0FdAB9BsKOzFKvpV_VcD21qEazGD1_Uk",
    "job_posted_date": "2024-12-22T08:39:35.045Z",
    "job_poster": {
      "name": "Tamara Elimelech (תמרה אלימלך) 🎗️",
      "title": "Career Growth Consultant | Talent Acquisition Expert | Recruitment Services A-Z | People First |",
      "url": "https://il.linkedin.com/in/tamara-tcr"
    },
    "application_availability": true,
    "job_description_formatted": "<section class=\"show-more-less-html\" data-max-lines=\"5\">\n        <div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <p><strong>About the Company</strong> - <strong>Magenta Medical is a medical device company developing the world&#x2019;s smallest heart pump, meant to provide minimally-invasive support to the heart during acute episodes of dysfunction. </strong>The Elevate&#x2122; System is multi-disciplinary, involving mechanical engineering, material science, electrical engineering, software, algorithms, and state-of-the-art catheter fabrication techniques.</p><p>We are seeking exceptional individuals to help drive the Elevate&#x2122; System forward and potentially save more lives</p><p><br></p><p><strong>About the Role</strong></p><p><strong>We are looking for a highly skilled and motivated Assistant Controller to join our finance team and support the company&#x2019;s financial operations.</strong></p><p><strong>Reports to: Financial Controller Key</strong> </p><p><br></p><p><strong>Responsibilities</strong></p><ul><li>Oversee payroll controllers in Israel and the US, as well as the overall payroll process.</li><li>Support the bookkeeper and provide guidance on accounting matters.</li><li>Ensure compliance with company policies and processes, including travel expenses and expense reimbursements.</li><li>Assist in the preparation of quarterly and annual financial statements.</li><li>Prepare the annual tax report and fulfill other statutory reporting requirements.</li></ul><p><br></p><p><br></p><p><strong>Qualifications</strong></p><p><br></p><ul><li>CPA post-internship with a minimum of 2 years of experience as an assistant controller &#x2013; must.</li><li>Fluency in English (both spoken and written) &#x2013; must.</li><li>Strong proficiency in Excel and the ability to quickly learn new software and systems &#x2013; must.</li><li>Familiarity with Priority and QuickBooks &#x2013; preferred.</li><li>Excellent communication skills and a team-oriented mindset.</li><li>Strong analytical abilities, detail-oriented.</li></ul><p></p>\n        </div>\n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--more\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\" aria-label=\"i18n_show_more\" aria-expanded=\"false\">\n<!---->\n        \n            Show more\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/cyolgscd0imw2ldqppkrb84vo\"></icon>\n    </button>\n  \n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--less\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\" aria-label=\"i18n_show_less\" aria-expanded=\"true\">\n<!---->\n        \n            Show less\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/4chtt12k98xwnba1nimld2oyg\"></icon>\n    </button>\n  \n<!---->    </section>",
    "base_salary": {
      "min_amount": null,
      "max_amount": null,
      "currency": null,
      "payment_period": null
    },
    "timestamp": "2024-12-22T09:39:35.067Z",
    "input": {
      "url": "https://il.linkedin.com/jobs/view/assistant-financial-controller-at-magenta-medical-ltd-4107524493"
    }
  },
  {
    "url": "https://www.linkedin.com/jobs/view/it-specialist-416-at-beach-bum-4107529192?lg=en",
    "job_posting_id": "4107529192",
    "job_title": "IT Specialist 416",
    "company_name": "Beach Bum",
    "company_id": "10455226",
    "job_location": "Raanana, Center District, Israel",
    "job_summary": "You're invited to Join Beach Bum, the greatest gaming family that brings a new twist to classic games by introducing them to the world of online casual games. We are looking for a technological talented IT Support Specialist join our team. Job Description: Supporting employees worldwide - with all IT issues Installing and upgrading PC’s system components working with networks appliances such as: Firewalls, Switches, and Access Points Responsibility for Devices & Users Management via Microsoft & Google Platforms Responsibility for setup and configuring Payroll software’s Configuring and administrating Information systems Job Requirements: At least 2 years' experience in a similar position Knowledge in Fortinet Firewalls Knowledge in NAS devices MCSA/MCSE/CCNA certificate - advantage Knowledge of Intune, Azure Active Directory Google Workspace and Microsoft Office 365 apps Experience with payroll software’s such as: Hashavit, Shiklulit Experienced with support for Windows & MAC OS and Office applications. Knowledge of troubleshooting hardware, software issues Fluent in English communication - Must Soft skills: Ability to work independently / team, with multi-tasking capabilities Excellent communication skills Hands-on with a can-do approach Show more Show less",
    "job_seniority_level": "Entry level",
    "job_function": "Information Technology",
    "job_employment_type": "Full-time",
    "job_industries": "Computer Games",
    "company_url": "https://il.linkedin.com/company/beach-bum-ltd?trk=public_jobs_topcard-org-name",
    "job_posted_time": "16 minutes ago",
    "job_num_applicants": 25,
    "discovery_input": {
      "url": "https://www.linkedin.com/jobs/search?keywords=Software&location=Tel%20Aviv-Yafo&geoId=101570771&trk=public_jobs_jobs-search-bar_search-submit&position=1&pageNum=0&f_TPR=r3600"
    },
    "apply_link": null,
    "country_code": null,
    "title_id": "71",
    "job_posted_date": "2024-12-22T09:23:54.541Z",
    "job_poster": {
      "name": null,
      "title": null,
      "url": null
    },
    "application_availability": true,
    "job_description_formatted": "<section class=\"show-more-less-html\" data-max-lines=\"5\">\n        <div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <p><strong>You&apos;re invited to Join Beach Bum, the greatest gaming family that brings a new twist to classic games by introducing them to the world of online casual games.</strong></p><p><br></p><p><em>We are looking for a technological talented IT Support Specialist join our team.</em></p><p><br></p><p><strong>Job Description:</strong></p><ul><li>Supporting employees worldwide - with all IT issues</li><li>Installing and upgrading PC&#x2019;s system components</li><li>working with networks appliances such as: Firewalls, Switches, and Access Points</li><li>Responsibility for Devices &amp; Users Management via Microsoft &amp; Google Platforms</li><li>Responsibility for setup and configuring Payroll software&#x2019;s</li><li>Configuring and administrating Information systems</li></ul><p><br></p><p><strong>Job Requirements: </strong></p><ul><li>At least 2 years&apos; experience in a similar position</li><li>Knowledge in Fortinet Firewalls</li><li>Knowledge in NAS devices</li><li>MCSA/MCSE/CCNA certificate - advantage</li><li>Knowledge of Intune, Azure Active Directory Google Workspace and Microsoft Office 365 apps</li><li>Experience with payroll software&#x2019;s such as: Hashavit, Shiklulit</li><li>Experienced with support for Windows &amp; MAC OS and Office applications.</li><li>Knowledge of troubleshooting hardware, software issues</li><li>Fluent in English communication - Must </li></ul><p><br></p><p><strong>Soft skills: </strong></p><ul><li>Ability to work independently / team, with multi-tasking capabilities</li><li>Excellent communication skills</li><li>Hands-on with a can-do approach</li></ul><p></p>\n        </div>\n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--more\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\" aria-label=\"i18n_show_more\" aria-expanded=\"false\">\n<!---->\n        \n            Show more\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\" aria-hidden=\"true\" aria-busy=\"false\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"16\" height=\"16\" preserveAspectRatio=\"xMinYMin meet\" focusable=\"false\" class=\"lazy-loaded\" aria-busy=\"false\"><path d=\"M8 9l5.93-4L15 6.54l-6.15 4.2a1.5 1.5 0 01-1.69 0L1 6.54 2.07 5z\" fill=\"currentColor\"/></svg></icon>\n    </button>\n  \n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--less\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\" aria-label=\"i18n_show_less\" aria-expanded=\"true\">\n<!---->\n        \n            Show less\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\" aria-hidden=\"true\" aria-busy=\"false\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"16\" height=\"16\" preserveAspectRatio=\"xMinYMin meet\" focusable=\"false\" class=\"lazy-loaded\" aria-busy=\"false\"><path d=\"M8 7l-5.9 4L1 9.5l6.2-4.2c.5-.3 1.2-.3 1.7 0L15 9.5 13.9 11 8 7z\" fill=\"currentColor\"/></svg></icon>\n    </button>\n  \n<!---->    </section>",
    "base_salary": {
      "min_amount": null,
      "max_amount": null,
      "currency": null,
      "payment_period": null
    },
    "timestamp": "2024-12-22T09:39:54.558Z",
    "input": {
      "url": "https://il.linkedin.com/jobs/view/it-specialist-416-at-beach-bum-4107529192"
    }
  },
  {
    "url": "https://www.linkedin.com/jobs/view/cloud-full-stack-team-leader-for-a-leading-global-cyber-security-company-at-undisclosed-4106567137?lg=en",
    "job_posting_id": "4106567137",
    "job_title": "Cloud Full Stack Team Leader for a Leading Global Cyber Security Company",
    "company_name": "Undisclosed",
    "company_id": "86948453",
    "job_location": "Tel Aviv District, Israel",
    "job_summary": "Cloud Full Stack Team Leader for a Leading Global Cyber Security Company We are a global leader in cyber security and application delivery solutions for physical, cloud, and software-defined data centers. We live and breathe cyber security. It is our passion. Each day, our international team works to earn the trust of more than 12,500 organizations around the globe. Keeping them safe is our mission. Backed by nearly 30 years of experience, we are best known for our technical excellence and innovative network and application security solutions. That is why it is so important that we build our team with bold and bright talent. 👉We are looking for a Full Stack Team Leader to join our team. Your responsibilities: 📌Lead and mentor a team of full-stack developers to develop our next-gen web applications. 📌Collaborating with the product team, UX designers, and other R&D teams to secure our deliveries. 📌 Assume complete ownership over key areas of our platform, including code quality, time estimations, deployment to production, and monitoring. 📌Take an active part in the team’s efforts to deliver the best solutions for our services. 📌Manage, recommend, and execute infrastructure improvements and stay ahead with new technologies and best practices. What we require: - At least 2 years of experience in managing full-stack teams - Extensive experience in the design and development of web- applications - At least 3 years of experience in client-side development with React - At least 3 years of experience in server-side development with Java - Hands-on experience with NoSQL databases (MongoDB is preferred) - Experience with Linux environment and containers (Docker) - Experience with Agile development, effort estimations, and timelines management. ⭐A Stand out candidate will have: - Experience with Spring boot - Experience with NodeJS - Experience with Micro frontend architecture - Experience with cloud-based server infrastructure (Google Cloud Platform, AWS) Show more Show less",
    "job_seniority_level": "Mid-Senior level",
    "job_employment_type": "Full-time",
    "job_industries": "Technology, Information and Internet",
    "company_url": "https://www.linkedin.com/company/undiscl0sed?trk=public_jobs_topcard-org-name",
    "job_posted_time": "21 minutes ago",
    "job_num_applicants": 25,
    "discovery_input": {
      "url": "https://www.linkedin.com/jobs/search?keywords=Software&location=Tel%20Aviv-Yafo&geoId=101570771&trk=public_jobs_jobs-search-bar_search-submit&position=1&pageNum=0&f_TPR=r3600"
    },
    "apply_link": null,
    "country_code": null,
    "title_id": "3111",
    "company_logo": "https://static.licdn.com/aero-v1/sc/h/aajlclc14rr2scznz5qm2rj9u",
    "job_posted_date": "2024-12-22T09:18:58.874Z",
    "job_poster": {
      "name": "Hemde Wolshtein",
      "title": "A professional slasher: Head Hunter/marketing and personal branding expert/ Success Coach, who loves blending all of it to help you find and get the…",
      "url": "https://il.linkedin.com/in/hemde-wolshtein-4885a31ba"
    },
    "application_availability": true,
    "job_description_formatted": "<section class=\"show-more-less-html\" data-max-lines=\"5\">\n        <div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <p><strong>Cloud Full Stack Team Leader for a Leading Global Cyber Security Company</strong></p><p><span>We are a global leader in cyber security and application delivery solutions for physical, cloud, and software-defined data centers.</span></p><p><strong>We live and breathe cyber security. It is our passion. </strong></p><p><span>Each day, our international team works to earn the trust of more than 12,500 organizations around the globe. Keeping them safe is our mission.</span></p><p><br></p><p><span>Backed by nearly 30 years of experience, we are best known for our technical excellence and innovative network and application security solutions. That is why it is so important that we build our team with bold and bright talent.</span></p><p><br></p><p><strong>&#x1F449;We are looking for a Full Stack Team Leader to join our team.</strong></p><p><strong>Your responsibilities:</strong></p><p><span>&#x1F4CC;Lead and mentor a team of full-stack developers to develop our next-gen web applications.</span></p><p><span>&#x1F4CC;Collaborating with the product team, UX designers, and other R&amp;D teams to secure our deliveries.</span></p><p><span>&#x1F4CC; Assume complete ownership over key areas of our platform, including code quality, time estimations, deployment to production, and monitoring.</span></p><p><span>&#x1F4CC;Take an active part in the team&#x2019;s efforts to deliver the best solutions for our services.</span></p><p><span>&#x1F4CC;Manage, recommend, and execute infrastructure improvements and stay ahead with new technologies and best practices.</span></p><p><strong>What we require:</strong></p><p><span>- At least 2 years of experience in managing full-stack teams</span></p><p><span>- Extensive experience in the design and development of web-&#xA0; applications</span></p><p><span>- At least 3 years of experience in client-side development with React</span></p><p><span>- At least 3 years of experience in server-side development with Java</span></p><p><span>- Hands-on experience with NoSQL databases (MongoDB is preferred)</span></p><p><span>- Experience with Linux environment and containers (Docker)</span></p><p><span>- Experience with Agile development, effort estimations, and timelines management.</span></p><p><strong>&#x2B50;A Stand out candidate will have:</strong></p><p><span>- Experience with Spring boot</span></p><p><span>- Experience with NodeJS&#xA0;</span></p><p><span>- Experience with Micro frontend architecture</span></p><p><span>- Experience with cloud-based server infrastructure (Google Cloud Platform, AWS)</span></p><p><br></p><p><br></p>\n        </div>\n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--more\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\" aria-label=\"i18n_show_more\" aria-expanded=\"false\">\n<!---->\n        \n            Show more\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/cyolgscd0imw2ldqppkrb84vo\"></icon>\n    </button>\n  \n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--less\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\" aria-label=\"i18n_show_less\" aria-expanded=\"true\">\n<!---->\n        \n            Show less\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/4chtt12k98xwnba1nimld2oyg\"></icon>\n    </button>\n  \n<!---->    </section>",
    "base_salary": {
      "min_amount": null,
      "max_amount": null,
      "currency": null,
      "payment_period": null
    },
    "timestamp": "2024-12-22T09:39:58.898Z",
    "input": {
      "url": "https://il.linkedin.com/jobs/view/cloud-full-stack-team-leader-for-a-leading-global-cyber-security-company-at-undisclosed-4106567137"
    }
  },
  {
    "url": "https://www.linkedin.com/jobs/view/automation-engineer-at-bluesnap-4044349690?lg=en",
    "job_posting_id": "4044349690",
    "job_title": "Automation Engineer",
    "company_name": "BlueSnap",
    "company_id": "52768",
    "job_location": "Herzliya, Tel Aviv District, Israel",
    "job_summary": "BlueSnap, an international payments company, is seeking an experienced and motivated Automation Engineer to join one of our development teams and help us improve our automated testing capabilities. The team is focused on building the next generation of services that pay thousands of BlueSnap merchants worldwide. As an Automation Engineer, you will lead the testing process and engage in every phase of our software development life cycle. Our offices are in Herzliya, and we work in a hybrid work mode. What will you do? Plan, designed, developed, and executed Java-based automation tests for functional and acceptance testing. Write, maintain, and improve backend automation tests and API tests. Create a robust framework and coverage of components/ integration and E2E test. Drive the continuous testing and delivery practices within the team, integrating automated tests with CI/CD pipelines using tools like Jenkins or Gitlab. Demonstrate a high ability to understand complex products, anticipate potential customer use cases, and design comprehensive tests to validate these scenarios thoroughly. Collaborate with cross-functional teams to define, design, and release new features. What will you need? At least 5 years of experience as an Automation Engineer. At least 3 years of experience programming in Java. Deep understanding of test automation frameworks such as JUnit or Cucumber. Experience with deployment cycle and tools like Jenkins, Gitlab, etc. Strong knowledge of SQL. Experience with Linux scripting and fundamentals. Experience working with cloud providers such as OCI (significant advantage) / AWS / Google Cloud / Azure and with a microservices architecture. Experience working with Docker and Kubernetes Attention to detail, Strong analytical skills, and the ability to solve complex problems under tight deadlines. Excellent time management and multi-tasking skills Familiarity with Middleware technologies, in particular message queue (advantage RabbitMQ) Nice to have: B.Sc. in Computer Science or Software Engineering Show more Show less",
    "job_seniority_level": "Mid-Senior level",
    "job_function": "Engineering and Quality Assurance",
    "job_employment_type": "Full-time",
    "job_industries": "Software Development",
    "company_url": "https://www.linkedin.com/company/bluesnap?trk=public_jobs_topcard-org-name",
    "job_posted_time": "1 hour ago",
    "job_num_applicants": 196,
    "discovery_input": {
      "url": "https://www.linkedin.com/jobs/search?keywords=Software&location=Tel%20Aviv-Yafo&geoId=101570771&trk=public_jobs_jobs-search-bar_search-submit&position=1&pageNum=0&f_TPR=r3600"
    },
    "apply_link": null,
    "country_code": null,
    "title_id": "1510",
    "job_posted_date": "2024-12-22T08:40:03.694Z",
    "job_poster": {
      "name": "Yulia Zavedivker",
      "title": "Director of HR & Employer Branding",
      "url": "https://il.linkedin.com/in/yulia-zavedivker-17940225"
    },
    "application_availability": true,
    "job_description_formatted": "<section class=\"show-more-less-html\" data-max-lines=\"5\">\n        <div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <p>BlueSnap, an international payments company, is seeking an experienced and motivated Automation Engineer to join one of our development teams and help us improve our automated testing capabilities. The team is focused on building the next generation of services that pay thousands of BlueSnap merchants worldwide.</p><p>As an Automation Engineer, you will lead the testing process and engage in every phase of our software development life cycle.</p><p>Our offices are in Herzliya, and we work in a hybrid work mode.</p><p><br></p><p><strong>What will you do?</strong></p><ul><li>Plan, designed, developed, and executed Java-based automation tests for functional and acceptance testing.</li><li>Write, maintain, and improve backend automation tests and API tests.</li><li>Create a robust framework and coverage of components/ integration and E2E test.</li><li>Drive the continuous testing and delivery practices within the team, integrating automated tests with CI/CD pipelines using tools like Jenkins or Gitlab.</li><li>Demonstrate a high ability to understand complex products, anticipate potential customer use cases, and design comprehensive tests to validate these scenarios thoroughly.</li><li>Collaborate with cross-functional teams to define, design, and release new features.</li></ul><p><strong>What will you need?</strong></p><ul><li>At least 5 years of experience as an Automation Engineer.</li><li>At least 3 years of experience programming in Java.</li><li>Deep understanding of test automation frameworks such as JUnit or Cucumber.</li><li>Experience with deployment cycle and tools like Jenkins, Gitlab, etc.</li><li>Strong knowledge of SQL.</li><li>Experience with Linux scripting and fundamentals.</li><li>Experience working with cloud providers such as OCI (significant advantage) / AWS / Google Cloud / Azure and with a microservices architecture.</li><li>Experience working with Docker and Kubernetes</li><li>Attention to detail, Strong analytical skills, and the ability to solve complex problems under tight deadlines. Excellent time management and multi-tasking skills</li><li>Familiarity with Middleware technologies, in particular message queue (advantage RabbitMQ)</li></ul><p><u>Nice to have:</u></p><ul><li>B.Sc. in Computer Science or Software Engineering</li></ul><p></p>\n        </div>\n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--more\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\" aria-label=\"i18n_show_more\" aria-expanded=\"false\">\n<!---->\n        \n            Show more\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\" aria-hidden=\"true\" aria-busy=\"false\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"16\" height=\"16\" preserveAspectRatio=\"xMinYMin meet\" focusable=\"false\" class=\"lazy-loaded\" aria-busy=\"false\"><path d=\"M8 9l5.93-4L15 6.54l-6.15 4.2a1.5 1.5 0 01-1.69 0L1 6.54 2.07 5z\" fill=\"currentColor\"/></svg></icon>\n    </button>\n  \n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--less\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\" aria-label=\"i18n_show_less\" aria-expanded=\"true\">\n<!---->\n        \n            Show less\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\" aria-hidden=\"true\" aria-busy=\"false\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"16\" height=\"16\" preserveAspectRatio=\"xMinYMin meet\" focusable=\"false\" class=\"lazy-loaded\" aria-busy=\"false\"><path d=\"M8 7l-5.9 4L1 9.5l6.2-4.2c.5-.3 1.2-.3 1.7 0L15 9.5 13.9 11 8 7z\" fill=\"currentColor\"/></svg></icon>\n    </button>\n  \n<!---->    </section>",
    "base_salary": {
      "min_amount": null,
      "max_amount": null,
      "currency": null,
      "payment_period": null
    },
    "timestamp": "2024-12-22T09:40:03.719Z",
    "input": {
      "url": "https://il.linkedin.com/jobs/view/automation-engineer-at-bluesnap-4044349690"
    }
  },
  {
    "url": "https://www.linkedin.com/jobs/view/director-of-product-fraud-abuse-at-cheq-4082262359?lg=en",
    "job_posting_id": "4082262359",
    "job_title": "Director of Product, Fraud & Abuse",
    "company_name": "CHEQ",
    "company_id": "10041033",
    "job_location": "Tel Aviv District, Israel",
    "job_summary": "CHEQ is the global leader in Go-to-Market Security, trusted by over 15,000 customers worldwide to protect every aspect of their marketing, sales and data operation from bots, fake users, fraud and cyber attacks. Powered by award-winning cybersecurity technology, CHEQ offers the broadest suite of solutions for securing the entire funnel, from paid marketing to on-site conversion, data and analytics. CHEQ is a global company with offices in Tel-Aviv, New York, UK and Tokyo. We are seeking a Director of Product to join our team and lead our Fraud & Abuse Management products. As a Director of Product, you will play a vital role in defining and executing the product plan, ensuring that our products meet the needs of our customers and drive business growth. You will collaborate closely with cross-functional teams, including engineering, design, marketing, and customer support, to develop and deliver innovative solutions that empower our clients to protect their website and APIs from fraud, abuse and bot attacks. Responsibilities : Product Strategy and Roadmap : Develop and communicate a clear and compelling product strategy for your products, aligned with the company's vision and market trends. Collaborate with key stakeholders to define the product roadmap and prioritize features based on customer needs, market opportunities, and business goals. Market and Customer Research : Conduct market research and gather customer insights to identify market trends, customer pain points, and opportunities for product enhancements. Use this information to drive product innovation and differentiation. Product Development and Execution : Work closely with the engineering and design teams to translate product requirements into actionable plans. Define user stories, prioritize feature development, and ensure timely delivery of high-quality solutions. Collaborate with engineering teams to address technical challenges and ensure product scalability, reliability, and security. Cross-functional Collaboration : Partner with marketing and sales teams to gather customer feedback, understand market demands, and ensure successful product launches. Provide product expertise and support to these teams, enabling them to effectively promote, sell, and support Ensighten.com products. Product Performance Analysis : Define and track key performance indicators (KPIs) to evaluate the success and impact of the products. Monitor user adoption, customer satisfaction, and revenue growth metrics. Analyze data and user feedback to identify areas for improvement and drive product optimization. Competitive Analysis : Stay informed about the competitive landscape and emerging industry trends related to online risk and fraud. Conduct competitive analysis to identify product gaps and opportunities for differentiation. Use this information to refine the product roadmap and drive competitive advantage. Customer Advocacy : Serve as a customer advocate throughout the product development process. Engage with customers, understand their pain points, and incorporate their feedback into product requirements and enhancements. Continuously seek opportunities to improve the customer experience and drive customer success with Ensighten.com products. Requirements : Proven Experience : At least 5 years of experience in product management in online risk management, onsite fraud prevention, or bot mitigation. Experience with enterprise software products and B2B markets is mandatory. Technical Knowledge : Solid understanding of APIs, javascript, and networking. Familiarity with relevant cybersecurity technologies and techniques. Customer Focus : Passion for understanding customer needs and delivering exceptional user experiences. Demonstrated ability to translate customer requirements into actionable product features. Strategic Thinking : Ability to think strategically and align product initiatives with business goals. Proven track record of developing and executing product strategies that drive revenue growth and market success. Strong Communication Skills : Excellent written and verbal communication skills in English, with the ability to effectively collaborate with cross-functional teams, present ideas, and influence stakeholders at all levels. Analytical and Data-driven : Proficient in data analysis, using metrics and analytics tools to inform product decision-making. Ability to draw insights from data, identify trends, and make informed decisions. Project Management : Strong project management skills, with the ability to manage multiple priorities, meet deadlines, and drive results in a fast-paced environment. Bachelor's or Master's degree in computer science, engineering, business administration, or a related field is preferred. Show more Show less",
    "job_seniority_level": "Mid-Senior level",
    "job_function": "Product Management",
    "job_employment_type": "Full-time",
    "job_industries": "Computer and Network Security",
    "company_url": "https://www.linkedin.com/company/cheq-ai?trk=public_jobs_topcard-org-name",
    "job_posted_time": "1 hour ago",
    "job_num_applicants": 47,
    "discovery_input": {
      "url": "https://www.linkedin.com/jobs/search?keywords=Software&location=Tel%20Aviv-Yafo&geoId=101570771&trk=public_jobs_jobs-search-bar_search-submit&position=1&pageNum=0&f_TPR=r3600"
    },
    "apply_link": null,
    "country_code": null,
    "title_id": "671",
    "job_posted_date": "2024-12-22T08:40:03.957Z",
    "job_poster": {
      "name": null,
      "title": null,
      "url": null
    },
    "application_availability": true,
    "job_description_formatted": "<section class=\"show-more-less-html\" data-max-lines=\"5\">\n        <div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <p>CHEQ is the global leader in Go-to-Market Security, trusted by over 15,000 customers worldwide to protect every aspect of their marketing, sales and data operation from bots, fake users, fraud and cyber attacks.</p><p><br></p><p>Powered by award-winning cybersecurity technology, CHEQ offers the broadest suite of solutions for securing the entire funnel, from paid marketing to on-site conversion, data and analytics.</p><p><br></p><p>CHEQ is a global company with offices in Tel-Aviv, New York, UK and Tokyo.</p><p><br></p><p>We are seeking a Director of Product to join our team and lead our Fraud &amp; Abuse Management products.</p><p><br></p><p>As a Director of Product, you will play a vital role in defining and executing the product plan, ensuring that our products meet the needs of our customers and drive business growth.</p><p><br></p><p>You will collaborate closely with cross-functional teams, including engineering, design, marketing, and customer support, to develop and deliver innovative solutions that empower our clients to protect their website and APIs from fraud, abuse and bot attacks.</p><p><br></p><p><strong>Responsibilities</strong>:</p><p><br></p><ul><li><u>Product Strategy and Roadmap</u>: Develop and communicate a clear and compelling product strategy for your products, aligned with the company&apos;s vision and market trends. Collaborate with key stakeholders to define the product roadmap and prioritize features based on customer needs, market opportunities, and business goals.</li><li><u>Market and Customer Research</u>: Conduct market research and gather customer insights to identify market trends, customer pain points, and opportunities for product enhancements. Use this information to drive product innovation and differentiation.</li><li><u>Product Development and Execution</u>: Work closely with the engineering and design teams to translate product requirements into actionable plans. Define user stories, prioritize feature development, and ensure timely delivery of high-quality solutions. Collaborate with engineering teams to address technical challenges and ensure product scalability, reliability, and security.</li><li><u>Cross-functional Collaboration</u>: Partner with marketing and sales teams to gather customer feedback, understand market demands, and ensure successful product launches. Provide product expertise and support to these teams, enabling them to effectively promote, sell, and support Ensighten.com products.</li><li><u>Product Performance Analysis</u>: Define and track key performance indicators (KPIs) to evaluate the success and impact of the products. Monitor user adoption, customer satisfaction, and revenue growth metrics. Analyze data and user feedback to identify areas for improvement and drive product optimization.</li><li><u>Competitive Analysis</u>: Stay informed about the competitive landscape and emerging industry trends related to online risk and fraud. Conduct competitive analysis to identify product gaps and opportunities for differentiation. Use this information to refine the product roadmap and drive competitive advantage.</li><li><u>Customer Advocacy</u>: Serve as a customer advocate throughout the product development process. Engage with customers, understand their pain points, and incorporate their feedback into product requirements and enhancements. Continuously seek opportunities to improve the customer experience and drive customer success with Ensighten.com products.</li></ul><p><br></p><p><strong>Requirements</strong>:</p><p><br></p><ul><li><u>Proven Experience</u>: At least 5 years of experience in product management in online risk management, onsite fraud prevention, or bot mitigation. Experience with enterprise software products and B2B markets is mandatory.</li><li><u>Technical Knowledge</u>: Solid understanding of APIs, javascript, and networking. Familiarity with relevant cybersecurity technologies and techniques.</li><li><u>Customer Focus</u>: Passion for understanding customer needs and delivering exceptional user experiences. Demonstrated ability to translate customer requirements into actionable product features.</li><li><u>Strategic Thinking</u>: Ability to think strategically and align product initiatives with business goals. Proven track record of developing and executing product strategies that drive revenue growth and market success.</li><li><u>Strong Communication Skills</u>: Excellent written and verbal communication skills in English, with the ability to effectively collaborate with cross-functional teams, present ideas, and influence stakeholders at all levels.</li><li><u>Analytical and Data-driven</u>: Proficient in data analysis, using metrics and analytics tools to inform product decision-making. Ability to draw insights from data, identify trends, and make informed decisions.</li><li><u>Project Management</u>: Strong project management skills, with the ability to manage multiple priorities, meet deadlines, and drive results in a fast-paced environment.</li><li><u>Bachelor&apos;s or Master&apos;s degree</u> in computer science, engineering, business administration, or a related field is preferred.</li></ul><p></p>\n        </div>\n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--more\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\" aria-label=\"i18n_show_more\" aria-expanded=\"false\">\n<!---->\n        \n            Show more\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/cyolgscd0imw2ldqppkrb84vo\"></icon>\n    </button>\n  \n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--less\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\" aria-label=\"i18n_show_less\" aria-expanded=\"true\">\n<!---->\n        \n            Show less\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\" aria-hidden=\"true\" aria-busy=\"false\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"16\" height=\"16\" preserveAspectRatio=\"xMinYMin meet\" focusable=\"false\" class=\"lazy-loaded\" aria-busy=\"false\"><path d=\"M8 7l-5.9 4L1 9.5l6.2-4.2c.5-.3 1.2-.3 1.7 0L15 9.5 13.9 11 8 7z\" fill=\"currentColor\"/></svg></icon>\n    </button>\n  \n<!---->    </section>",
    "base_salary": {
      "min_amount": null,
      "max_amount": null,
      "currency": null,
      "payment_period": null
    },
    "timestamp": "2024-12-22T09:40:03.973Z",
    "input": {
      "url": "https://il.linkedin.com/jobs/view/director-of-product-fraud-abuse-at-cheq-4082262359"
    }
  },
  {
    "url": "https://www.linkedin.com/jobs/view/embedded-vulnerability-researcher-at-plaxidityx-formerly-argus-4108011180?lg=en",
    "job_posting_id": "4108011180",
    "job_title": "Embedded Vulnerability Researcher",
    "company_name": "PlaxidityX (Formerly Argus)",
    "company_id": "5200367",
    "job_location": "Center District, Israel",
    "job_summary": "Who are we? Plaxidityx is a global leader in the automotive cybersecurity industry. We protect drivers & manufacturers from cyber attacks on their vehicles. We use top-notch technology & have several products for inside & outside the car. Our growing team is built of talented thinkers and we are always looking for more! Why PlaxidityX? You can be part of a leading company in the automotive industry You can help save lives You can work with cool challenging technology You can make an impact & help change the world Responsibilities: Exposing and exploiting new vulnerabilities in vehicular systems Penetration testing of automotive embedded systems Research automotive networks and protocols Hardware and software reverse-engineering on a variety of platforms (Bare Metal embedded systems, FreeRTOS, QNX, Linux and more) Work with various new top-of-the-line vehicles, both in Israel and abroad Requirements: 3+ years security research experience Extensive experience in cyber security reverse engineering Experience in exposing and exploiting vulnerabilities An excellent team player, getting-things-done individual with high self learning abilities Experience in research of Embedded/Low-Level systems Familiarity with hardware analysis: PCB & chip level security analysis, Physical layer communication protocol analysis, Using laboratory equipment (such as: Oscilloscope, Spectrum Analyzer, Logic analyzer). Proven experience in leading projects and overseeing processes Advantages: Experience in a managerial role Highly knowledgeable in Linux / QNX / Android systems both user and kernel space Knowledge and experience with cryptographic hardware and libraries Proven expertise and hands-on experience with the automotive ecosystem, including familiarity with industry-standard protocols and architectures Show more Show less",
    "job_seniority_level": "Mid-Senior level",
    "job_function": "Research, Engineering, and Science",
    "job_employment_type": "Full-time",
    "job_industries": "Computers and Electronics Manufacturing, Computer Hardware Manufacturing, and Computer and Network Security",
    "company_url": "https://il.linkedin.com/company/plaxidityx?trk=public_jobs_topcard-org-name",
    "job_posted_time": "24 minutes ago",
    "job_num_applicants": 25,
    "discovery_input": {
      "url": "https://www.linkedin.com/jobs/search?keywords=Software&location=Tel%20Aviv-Yafo&geoId=101570771&trk=public_jobs_jobs-search-bar_search-submit&position=1&pageNum=0&f_TPR=r3600"
    },
    "apply_link": null,
    "country_code": null,
    "title_id": "5848",
    "company_logo": "https://media.licdn.com/dms/image/v2/D4E0BAQGeVghMSiH2Vg/company-logo_100_100/company-logo_100_100/0/1723368328153/argus_cyber_security_logo?e=2147483647&v=beta&t=NJjivbnbF3AmZBHaswBNX-rdz_46ZNdg-zzO9xUdGZQ",
    "job_posted_date": "2024-12-22T09:16:05.591Z",
    "job_poster": {
      "name": null,
      "title": null,
      "url": null
    },
    "application_availability": true,
    "job_description_formatted": "<section class=\"show-more-less-html\" data-max-lines=\"5\">\n        <div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <p><strong>Who are we?</strong></p><p>Plaxidityx is a global leader in the automotive cybersecurity industry. We protect drivers &amp; manufacturers from cyber attacks on their vehicles. We use top-notch technology &amp; have several products for inside &amp; outside the car. Our growing team is built of talented thinkers and we are always looking for more!</p><p><br></p><p><strong>Why PlaxidityX?</strong></p><ul><li>You can be part of a leading company in the automotive industry</li><li>You can help save lives</li><li>You can work with cool challenging technology</li><li>You can make an impact &amp; help change the world</li></ul><p><br></p><p><strong>Responsibilities: </strong></p><ul><li>Exposing and exploiting new vulnerabilities in vehicular systems</li><li>Penetration testing of automotive embedded systems</li><li>Research automotive networks and protocols</li><li>Hardware and software reverse-engineering on a variety of platforms (Bare Metal embedded systems, FreeRTOS, QNX, Linux and more)</li><li>Work with various new top-of-the-line vehicles, both in Israel and abroad</li></ul><p><br></p><p><strong>Requirements: </strong></p><ul><li>3+ years security research experience</li><li>Extensive experience in cyber security reverse engineering</li><li>Experience in exposing and exploiting vulnerabilities</li><li>An excellent team player, getting-things-done individual with high self learning abilities</li><li>Experience in research of Embedded/Low-Level systems</li><li>Familiarity with hardware analysis: PCB &amp; chip level security analysis, Physical layer communication protocol analysis, Using laboratory equipment (such as: Oscilloscope, Spectrum Analyzer, Logic analyzer).</li><li>Proven experience in leading projects and overseeing processes</li></ul><p><br></p><p><strong>Advantages: </strong></p><ul><li>Experience in a managerial role</li><li>Highly knowledgeable in Linux / QNX / Android systems both user and kernel space</li><li>Knowledge and experience with cryptographic hardware and libraries</li><li>Proven expertise and hands-on experience with the automotive ecosystem, including familiarity with industry-standard protocols and architectures</li></ul><p></p>\n        </div>\n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--more\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\" aria-label=\"i18n_show_more\" aria-expanded=\"false\">\n<!---->\n        \n            Show more\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/cyolgscd0imw2ldqppkrb84vo\"></icon>\n    </button>\n  \n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--less\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\" aria-label=\"i18n_show_less\" aria-expanded=\"true\">\n<!---->\n        \n            Show less\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/4chtt12k98xwnba1nimld2oyg\"></icon>\n    </button>\n  \n<!---->    </section>",
    "base_salary": {
      "min_amount": null,
      "max_amount": null,
      "currency": null,
      "payment_period": null
    },
    "timestamp": "2024-12-22T09:40:05.610Z",
    "input": {
      "url": "https://il.linkedin.com/jobs/view/embedded-vulnerability-researcher-at-plaxidityx-formerly-argus-4108011180"
    }
  },
  {
    "url": "https://www.linkedin.com/jobs/view/system-integration-specialist-at-comda-4102962058?lg=en",
    "job_posting_id": "4102962058",
    "job_title": "System Integration Specialist",
    "company_name": "COMDA",
    "company_id": "54722",
    "job_location": "Tel Aviv District, Israel",
    "job_summary": "COMDA is an innovative and well-based software company, that is developing the next generation Information Security systems. COMDA has rich experience of 39 years in development and implementation of a variety of solutions in the field of smart identification and electronic signature of various types, on various devices such as smart cards, tokens, signature servers, cell phones, tablets of different types and PCs. Job Description We are looking for a highly motivated and energetic System Administrator to join our Integration team. The position includes building, configurating, managing, testing and monitoring all installed systems and infrastructure. These are operating systems, application software and system management tools. You will be part of a talented team of engineers that demonstrate superb technical competency, delivering mission critical infrastructure and ensuring the highest level of availability, performance and security. The position includes working with our enterprise clients at their facilities. What does it take to join us? • At least 3 years of experience as a System Administrator or as a system engineer- a must. • Experience with MS infrastructure tools (e.g. Active Directory, Exchange, SQL). • Experience with VMware and Storage system. • Microsoft CA documents and PKI- a big advantage. • High level knowledge and experience with OTP and/or HSM's - a big advantage. • Proven experience in virtualization and cloud services such as AWS, Azure. • Familiarity with communication protocols, backup systems and mail filtering systems. • Independent, energetic, fast learner, a team worker, highly motivated and results Oriented. Show more Show less",
    "job_seniority_level": "Not Applicable",
    "job_function": "Information Technology",
    "job_employment_type": "Full-time",
    "job_industries": "IT Services and IT Consulting",
    "company_url": "https://il.linkedin.com/company/comda?trk=public_jobs_topcard-org-name",
    "job_posted_time": "34 minutes ago",
    "job_num_applicants": 25,
    "discovery_input": {
      "url": "https://www.linkedin.com/jobs/search?keywords=Software&location=Tel%20Aviv-Yafo&geoId=101570771&trk=public_jobs_jobs-search-bar_search-submit&position=1&pageNum=0&f_TPR=r3600"
    },
    "apply_link": null,
    "country_code": null,
    "title_id": "25580",
    "job_posted_date": "2024-12-22T09:06:06.069Z",
    "job_poster": {
      "name": "Tom Charif",
      "title": "Talent Acquisition Team Lead at COMDA",
      "url": "https://il.linkedin.com/in/tom-charif-a49777132"
    },
    "application_availability": true,
    "job_description_formatted": "<section class=\"show-more-less-html\" data-max-lines=\"5\">\n        <div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <p><strong>COMDA</strong> is an innovative and well-based software company, that is developing the next generation Information Security systems.</p><p>COMDA has rich experience of 39 years in development and implementation of a variety of solutions in the field of smart identification and electronic signature of various types, on various devices such as smart cards, tokens, signature servers, cell phones, tablets of different types and PCs.</p><p><br></p><p><br></p><p><strong>Job Description</strong></p><p><br></p><p>We are looking for a highly motivated and energetic System Administrator to join our Integration team.</p><p>The position includes building, configurating, managing, testing and monitoring all installed systems and infrastructure. These are operating systems, application software and system management tools.</p><p>You will be part of a talented team of engineers that demonstrate superb technical competency, delivering mission critical infrastructure and ensuring the highest level of availability, performance and security.</p><p>The position includes working with our enterprise clients at their facilities.</p><p><br></p><p><strong>What does it take to join us?</strong></p><p>&#x2022; At least 3 years of experience as a System Administrator or as a system engineer-</p><p>a must.</p><p>&#x2022; Experience with MS infrastructure tools (e.g. Active Directory, Exchange, SQL).</p><p>&#x2022; Experience with VMware and Storage system.</p><p>&#x2022; Microsoft CA documents and PKI- a big advantage.</p><p>&#x2022; High level knowledge and experience with OTP and/or HSM&apos;s - a big advantage.</p><p>&#x2022; Proven experience in virtualization and cloud services such as AWS, Azure.</p><p>&#x2022; Familiarity with communication protocols, backup systems and mail filtering systems.</p><p>&#x2022; <strong>Independent, energetic, fast learner, a team worker, highly motivated and results </strong></p><p><strong> Oriented.</strong></p>\n        </div>\n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--more\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\" aria-label=\"i18n_show_more\" aria-expanded=\"false\">\n<!---->\n        \n            Show more\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\" aria-hidden=\"true\" aria-busy=\"false\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"16\" height=\"16\" preserveAspectRatio=\"xMinYMin meet\" focusable=\"false\" class=\"lazy-loaded\" aria-busy=\"false\"><path d=\"M8 9l5.93-4L15 6.54l-6.15 4.2a1.5 1.5 0 01-1.69 0L1 6.54 2.07 5z\" fill=\"currentColor\"/></svg></icon>\n    </button>\n  \n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--less\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\" aria-label=\"i18n_show_less\" aria-expanded=\"true\">\n<!---->\n        \n            Show less\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\" aria-hidden=\"true\" aria-busy=\"false\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"16\" height=\"16\" preserveAspectRatio=\"xMinYMin meet\" focusable=\"false\" class=\"lazy-loaded\" aria-busy=\"false\"><path d=\"M8 7l-5.9 4L1 9.5l6.2-4.2c.5-.3 1.2-.3 1.7 0L15 9.5 13.9 11 8 7z\" fill=\"currentColor\"/></svg></icon>\n    </button>\n  \n<!---->    </section>",
    "base_salary": {
      "min_amount": null,
      "max_amount": null,
      "currency": null,
      "payment_period": null
    },
    "timestamp": "2024-12-22T09:40:06.088Z",
    "input": {
      "url": "https://il.linkedin.com/jobs/view/system-integration-specialist-at-comda-4102962058"
    }
  },
  {
    "url": "https://www.linkedin.com/jobs/view/senior-software-engineer-at-btc-searching-4108010182?lg=en",
    "job_posting_id": "4108010182",
    "job_title": "Senior Software Engineer",
    "company_name": "BTC searching",
    "company_id": "65485674",
    "job_location": "Tel Aviv District, Israel",
    "job_summary": "One of our clients is seeking a skilled Full Stack Engineer (Backend-Oriented - 90%) to join their innovative R&D team. This company is a leading player in the financial technology space, dedicated to delivering transformative services to millions of customers worldwide. With headquarters in Israel and a hybrid work environment, this organization emphasizes career growth, work-life balance, and impactful work on consumer-facing products. About the Role - please read As a Full Stack Engineer, you will develop robust, scalable, and high-performance systems that serve over a million users monthly. Your focus will include designing and implementing core business logic, developing consumer-facing applications, and ensuring the performance, security, and scalability of mission-critical systems. While this role has a backend emphasis, you will also contribute to the frontend development, dedicating 10–20% of your time to building intuitive user interfaces using React . The position also requires hands-on experience with cloud platforms (preferably GCP) . Responsibilities Build scalable systems that support over one million monthly users. Develop complex core business logic and flows for real-world financial applications. Contribute to all aspects of software development, including security, scalability, and reliability. Focus on resilient distributed systems with high-performance and data integrity standards. Work closely with cross-functional teams to deliver top-tier consumer-facing products. Collaborate on the development of consumer-facing products, implementing frontend components in React as needed (10–20%). Leverage cloud technologies, with a preference for Google Cloud Platform (GCP) , to ensure system scalability and reliability. Requirements 4+ years of experience in production-grade software development. Bachelor's degree in Computer Science, Software Engineering, or equivalent experience. Expertise in building web servers using Node.js, Python, or Go . Strong understanding of API standards (REST, GraphQL, gRPC). Proficiency with relational and NoSQL databases. Hands-on experience with cloud platforms, preferably GCP . Familiarity with React , with the willingness and ability to contribute to frontend development (10–20% of the role). Company Location : Tel Aviv, Israel (Hybrid: 3 days in office 2 remote) Number of Employees : 2,000+ globally (200 in IL) This position reports to : R&D Team Lead. Show more Show less",
    "job_seniority_level": "Mid-Senior level",
    "job_function": "Engineering",
    "job_employment_type": "Full-time",
    "job_industries": "Software Development",
    "company_url": "https://www.linkedin.com/company/btc-searching?trk=public_jobs_topcard-org-name",
    "job_posted_time": "39 minutes ago",
    "job_num_applicants": 25,
    "discovery_input": {
      "url": "https://www.linkedin.com/jobs/search?keywords=Software&location=Tel%20Aviv-Yafo&geoId=101570771&trk=public_jobs_jobs-search-bar_search-submit&position=1&pageNum=0&f_TPR=r3600"
    },
    "apply_link": null,
    "country_code": null,
    "title_id": "9",
    "job_posted_date": "2024-12-22T09:01:09.261Z",
    "job_poster": {
      "name": "Einat Ben-Tzvi Cohen",
      "title": "Executive Search Consultant at BTC searching",
      "url": "https://il.linkedin.com/in/einatcohen"
    },
    "application_availability": true,
    "job_description_formatted": "<section class=\"show-more-less-html\" data-max-lines=\"5\">\n        <div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <p><strong>One of our clients</strong> is seeking a skilled <strong>Full Stack Engineer (Backend-Oriented - 90%)</strong> to join their innovative R&amp;D team. This company is a leading player in the financial technology space, dedicated to delivering transformative services to millions of customers worldwide. With headquarters in Israel and a hybrid work environment, this organization emphasizes career growth, work-life balance, and impactful work on consumer-facing products.</p><p><br></p><p><strong>About the Role - please read</strong></p><p>As a Full Stack Engineer, you will develop robust, scalable, and high-performance systems that serve over a million users monthly. Your focus will include designing and implementing core business logic, developing consumer-facing applications, and ensuring the performance, security, and scalability of mission-critical systems. While this role has a backend emphasis, you will also contribute to the frontend development, dedicating 10&#x2013;20% of your time to building intuitive user interfaces using <strong>React</strong>. The position also requires hands-on experience with <strong>cloud platforms (preferably GCP)</strong>.</p><p><br></p><p><strong>Responsibilities</strong></p><ul><li>Build scalable systems that support over one million monthly users.</li><li>Develop complex core business logic and flows for real-world financial applications.</li><li>Contribute to all aspects of software development, including security, scalability, and reliability.</li><li>Focus on resilient distributed systems with high-performance and data integrity standards.</li><li>Work closely with cross-functional teams to deliver top-tier consumer-facing products.</li><li>Collaborate on the development of consumer-facing products, implementing frontend components in <strong>React</strong> as needed (10&#x2013;20%).</li><li>Leverage cloud technologies, with a preference for <strong>Google Cloud Platform (GCP)</strong>, to ensure system scalability and reliability.</li></ul><li></li><p><strong>Requirements</strong></p><ul><li>4+ years of experience in production-grade software development.</li><li>Bachelor&apos;s degree in Computer Science, Software Engineering, or equivalent experience.</li><li>Expertise in building web servers using <strong>Node.js, Python, or Go</strong>.</li><li>Strong understanding of API standards (REST, GraphQL, gRPC).</li><li>Proficiency with relational and NoSQL databases.</li><li>Hands-on experience with cloud platforms, <strong>preferably GCP</strong>.</li><li>Familiarity with <strong>React</strong>, with the willingness and ability to contribute to frontend development (10&#x2013;20% of the role).</li></ul><p><br></p><p><strong>Company Location</strong>: Tel Aviv, Israel (Hybrid: 3 days in office 2 remote)</p><p><strong>Number of Employees</strong>: 2,000+ globally (200 in IL)</p><p><strong>This position reports to</strong>: R&amp;D Team Lead.</p>\n        </div>\n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--more\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\" aria-label=\"i18n_show_more\" aria-expanded=\"false\">\n<!---->\n        \n            Show more\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\" aria-hidden=\"true\" aria-busy=\"false\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"16\" height=\"16\" preserveAspectRatio=\"xMinYMin meet\" focusable=\"false\" class=\"lazy-loaded\" aria-busy=\"false\"><path d=\"M8 9l5.93-4L15 6.54l-6.15 4.2a1.5 1.5 0 01-1.69 0L1 6.54 2.07 5z\" fill=\"currentColor\"/></svg></icon>\n    </button>\n  \n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--less\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\" aria-label=\"i18n_show_less\" aria-expanded=\"true\">\n<!---->\n        \n            Show less\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon lazy-loaded\" aria-hidden=\"true\" aria-busy=\"false\"><svg xmlns=\"http://www.w3.org/2000/svg\" width=\"16\" height=\"16\" preserveAspectRatio=\"xMinYMin meet\" focusable=\"false\" class=\"lazy-loaded\" aria-busy=\"false\"><path d=\"M8 7l-5.9 4L1 9.5l6.2-4.2c.5-.3 1.2-.3 1.7 0L15 9.5 13.9 11 8 7z\" fill=\"currentColor\"/></svg></icon>\n    </button>\n  \n<!---->    </section>",
    "base_salary": {
      "min_amount": null,
      "max_amount": null,
      "currency": null,
      "payment_period": null
    },
    "timestamp": "2024-12-22T09:40:09.302Z",
    "input": {
      "url": "https://il.linkedin.com/jobs/view/senior-software-engineer-at-btc-searching-4108010182"
    }
  },
  {
    "url": "https://www.linkedin.com/jobs/view/hardware-engineer-at-niart-systems-ltd-4108004539?lg=en",
    "job_posting_id": "4108004539",
    "job_title": "Hardware Engineer",
    "company_name": "NIART SYSTEMS LTD",
    "company_id": "102892214",
    "job_location": "Rehovot, Center District, Israel",
    "job_summary": "Position Overview We are looking to extend our hardware team with 2 engineers – Senior Board Designer and Entry-Mid Level H/W engineer. Both roles will play a key part in developing our next top-of-the-line mm-wave radar. In these positions you will be responsible for developing the radar hardware starting from conceptual architecture, through detailed design, testing, integrating and validating all the way up to the transfer to production. Senior H/W engineer role requires excellent understanding in radar design and technologies and hands-on industry experience in design and bring-up of RF and Digital High speed boards and products. Junior H/W engineer must have proven experience with debugging and validation of RF, Analog and Digital boards. Both roles require tight collaboration with cross-functional teams, including Hardware, Firmware, System, Algorithms, Software, and subcontractors. Qualifications B.Sc in Electrical engineering Radar systems experience – Major advantage Senior : 5+ years industry experience in high-speed digital hardware design with high proficiency in Altium . Must have experience in all aspects of hardware design including schematics capture, PCB layout constraint, documentation, bring-up and design validations. Must have experience in common interfaces, PCIe, 10GE, DDR4, SPI, I2C, USB, MIPI, UART. Excellent knowledge of SI and PI for high-speed designs. Excellent knowledge of DC/DC switching power supply including Linear regulators. Familiarity with design for compliance/regulatory testing. Mid-Level : 2+years industry experience in digital hardware integration and validation Hands-on experience with lab prototyping (wiring and soldering). Hands-on experience in board debugging and testing (RF, digital and power). Experience with lab equipment, logic analyzer, oscilloscope, VNA, thermal chamber. Coding skills for data analysis and test equipment automation. Skills Good communication skills and be able to work with all cross-function teams. Accountable, independent, highly motivated, and capable of motivating others. Attention to detail and problem-solving skills Team Player with ‘yes we can’ approach Show more Show less",
    "job_seniority_level": "Mid-Senior level",
    "job_function": "Engineering",
    "job_employment_type": "Full-time",
    "job_industries": "Technology, Information and Internet",
    "company_url": "https://il.linkedin.com/company/niart-systems?trk=public_jobs_topcard-org-name",
    "job_posted_time": "1 hour ago",
    "job_num_applicants": 25,
    "discovery_input": {
      "url": "https://www.linkedin.com/jobs/search?keywords=Software&location=Tel%20Aviv-Yafo&geoId=101570771&trk=public_jobs_jobs-search-bar_search-submit&position=1&pageNum=0&f_TPR=r3600"
    },
    "apply_link": null,
    "country_code": null,
    "title_id": "668",
    "company_logo": "https://media.licdn.com/dms/image/v2/D560BAQFTJ0-Z9lpA7w/company-logo_100_100/company-logo_100_100/0/1724253080747/niart_systems_logo?e=2147483647&v=beta&t=XdEzodryFZv45Bw4tHFlnyP89V1J0i6sLEwEN5KhUNE",
    "job_posted_date": "2024-12-22T08:40:11.031Z",
    "job_poster": {
      "name": "Sergey Kolen",
      "title": "High performance Automotive 4D imaging radar | SI and PI | RF (W Band) and Digital High-speed (40Gbps) PCB design | IC Package FCCSP, FCBGA design |…",
      "url": "https://il.linkedin.com/in/sergey-kolen-1b938a13"
    },
    "application_availability": true,
    "job_description_formatted": "<section class=\"show-more-less-html\" data-max-lines=\"5\">\n        <div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <p><strong>Position Overview</strong></p><p><br></p><p><br></p><p>We are looking to extend our hardware team with 2 engineers &#x2013; Senior Board Designer and Entry-Mid Level H/W engineer. Both roles will play a key part in developing our next top-of-the-line mm-wave radar. In these positions you will be responsible for developing the radar hardware starting from conceptual architecture, through detailed design, testing, integrating and validating all the way up to the transfer to production.</p><p><br></p><p>Senior H/W engineer role requires excellent understanding in radar design and technologies and hands-on industry experience in design and bring-up of RF and Digital High speed boards and products.</p><p>Junior H/W engineer must have proven experience with debugging and validation of RF, Analog and Digital boards.</p><p>Both roles require tight collaboration with cross-functional teams, including Hardware, Firmware, System, Algorithms, Software, and subcontractors.</p><p><br></p><p><br></p><p><strong>Qualifications</strong></p><p><br></p><ul><li>B.Sc in Electrical engineering</li><li>Radar systems experience &#x2013; Major advantage</li></ul><p><br></p><ul><li><u>Senior</u>: 5+ years industry experience in high-speed digital hardware design with high proficiency in Altium .</li><li>Must have experience in all aspects of hardware design including schematics capture, PCB layout constraint, documentation, bring-up and design validations.</li><li>Must have experience in common interfaces, PCIe, 10GE, DDR4, SPI, I2C, USB, MIPI, UART.</li><li>Excellent knowledge of SI and PI for high-speed designs.</li><li>Excellent knowledge of DC/DC switching power supply including Linear regulators.</li><li>Familiarity with design for compliance/regulatory testing.</li></ul><p><br></p><ul><li><u>Mid-Level</u>: 2+years industry experience in digital hardware integration and validation</li><li>Hands-on experience with lab prototyping (wiring and soldering).</li><li>Hands-on experience in board debugging and testing (RF, digital and power).</li><li>Experience with lab equipment, logic analyzer, oscilloscope, VNA, thermal chamber.</li><li>Coding skills for data analysis and test equipment automation.</li></ul><p><br></p><p><br></p><p><strong>Skills</strong></p><p><br></p><ul><li>Good communication skills and be able to work with all cross-function teams.</li><li>Accountable, independent, highly motivated, and capable of motivating others.</li><li>Attention to detail and problem-solving skills</li><li>Team Player with &#x2018;yes we can&#x2019; approach</li></ul><p></p>\n        </div>\n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--more\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\" aria-label=\"i18n_show_more\" aria-expanded=\"false\">\n<!---->\n        \n            Show more\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/cyolgscd0imw2ldqppkrb84vo\"></icon>\n    </button>\n  \n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--less\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\" aria-label=\"i18n_show_less\" aria-expanded=\"true\">\n<!---->\n        \n            Show less\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/4chtt12k98xwnba1nimld2oyg\"></icon>\n    </button>\n  \n<!---->    </section>",
    "base_salary": {
      "min_amount": null,
      "max_amount": null,
      "currency": null,
      "payment_period": null
    },
    "timestamp": "2024-12-22T09:40:11.047Z",
    "input": {
      "url": "https://il.linkedin.com/jobs/view/hardware-engineer-at-niart-systems-ltd-4108004539"
    }
  },
  {
    "url": "https://www.linkedin.com/jobs/view/release-manager-at-nanit-4106568004?lg=en",
    "job_posting_id": "4106568004",
    "job_title": "Release Manager",
    "company_name": "Nanit",
    "company_id": "10082872",
    "job_location": "Tel Aviv District, Israel",
    "job_summary": "About Nanit: Welcome to Nanit, the high-growth baby tech company that is changing the way parents view their babies' wellness through the world’s most advanced baby monitor and parenting products. In 2016, the Nanit baby monitor revolutionized the industry with computer vision and machine-learning capabilities that helped parents understand their baby’s sleep patterns and allowed them to achieve better sleep quality. Now, the company has become the leader in the connected parenting space, with an incredible customer base of highly-engaged parents who look to Nanit as a source of information and expertise on their parenting journey. What you’ll be doing: End-to-end Release Management: Own the release lifecycle from scheduling and planning to deployment, ensuring that mobile app updates, hotfixes, and new features are compliant with medical device regulations and delivered on time while meeting the highest quality and safety standards. Cross-functional Coordination: Collaborate with Product, Engineering, and QA teams to ensure all release requirements are met, blockers are resolved, and issues are addressed promptly. Release Planning: Create and maintain detailed release schedules and milestones, taking into consideration regulatory requirements , user impact, and risk assessment. Ensure that all stages of the release are documented in compliance with medical device standards . Version Control & Documentation: Manage version control systems and maintain accurate release notes, tracking changes and updates across multiple versions. Risk Management: Identify and mitigate risks in the release process, proactively addressing potential issues that could impact timelines, quality, or regulatory compliance. Process Improvement: Continuously improve release processes by identifying bottlenecks and optimize efficiency. Post-release Review & Feedback : Coordinate feedback loops and post-release analysis to capture lessons learned, share insights, and refine future release processes. Who you are: 2+ years of experience in project management or release management within a regulated industry, ideally with a focus on mobile applications and medical devices. Strong project management skills : Excellent planning, organizational, and time management abilities, with a proven ability to manage multiple projects simultaneously. Exceptional communication skills : Comfortable providing frequent updates, managing stakeholder expectations, and working with cross-functional teams. Problem-solving mindset : Ability to handle complex release challenges and resolve issues in a time-sensitive environment. Technical Skills: Experience with mobile app development, deployment processes, and familiarity with version control systems. Knowledge of medical device software release requirements is a plus. Experience in the medical device industry or with regulatory release processes is a plus. Familiarity with Agile methodologies and experience using project management tools like Jira and Confluence. Fluency in English, both written and spoken. Bonus Skills: Understanding of automated testing and quality assurance practices. Familiarity with additional medical device regulations, such as FDA, ISO 13485, IEC 62304 for software development in medical devices. We are proud to be an equal opportunity employer. We provide employment opportunities without regard to age, race, color, ancestry, national origin, religion, disability, sex, gender identity or expression, sexual orientation, veteran status, or any other protected class. Show more Show less",
    "job_seniority_level": "Entry level",
    "job_function": "Information Technology",
    "job_employment_type": "Full-time",
    "job_industries": "Computers and Electronics Manufacturing",
    "company_url": "https://www.linkedin.com/company/nanit?trk=public_jobs_topcard-org-name",
    "job_posted_time": "4 minutes ago",
    "job_num_applicants": 25,
    "discovery_input": {
      "url": "https://www.linkedin.com/jobs/search?keywords=Software&location=Tel%20Aviv-Yafo&geoId=101570771&trk=public_jobs_jobs-search-bar_search-submit&position=1&pageNum=0&f_TPR=r3600"
    },
    "apply_link": "https://www.linkedin.com/jobs/view/externalApply/4106568004?url=https%3A%2F%2Fgrnh%2Ese%2F05c99eb64us&urlHash=bLim",
    "country_code": null,
    "title_id": "1666",
    "company_logo": "https://media.licdn.com/dms/image/v2/C4D0BAQG6B7FHRY3McQ/company-logo_100_100/company-logo_100_100/0/1634315795588/nanit_logo?e=2147483647&v=beta&t=BSVr5bUlJ-fvdbN0GmhOa0CE1CDxdd4ur9dmid9shwc",
    "job_posted_date": "2024-12-22T09:36:20.432Z",
    "job_poster": {
      "name": "Daniela Vagt",
      "title": "Talent Acquisition Specialist @ Nanit - 🌟 I'm Hiring! 🌟",
      "url": "https://il.linkedin.com/in/daniela-vagt"
    },
    "application_availability": true,
    "job_description_formatted": "<section class=\"show-more-less-html\" data-max-lines=\"5\">\n        <div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <p><strong>About Nanit:</strong></p><p><br></p><p>Welcome to Nanit, the high-growth baby tech company that is changing the way parents view their babies&apos; wellness through the world&#x2019;s most advanced baby monitor and parenting products. In 2016, the Nanit baby monitor revolutionized the industry with computer vision and machine-learning capabilities that helped parents understand their baby&#x2019;s sleep patterns and allowed them to achieve better sleep quality. Now, the company has become the leader in the connected parenting space, with an incredible customer base of highly-engaged parents who look to Nanit as a source of information and expertise on their parenting journey.</p><p><br></p><p><strong>What you&#x2019;ll be doing:</strong></p><ul><li><strong>End-to-end Release Management:</strong> Own the release lifecycle from scheduling and planning to deployment, ensuring that mobile app updates, hotfixes, and new features are <strong>compliant with medical device regulations</strong> and delivered on time while meeting the highest quality and safety standards.</li><li><strong>Cross-functional Coordination:</strong> Collaborate with Product, Engineering, and QA teams to ensure all release requirements are met, blockers are resolved, and issues are addressed promptly.</li><li><strong>Release Planning:</strong> Create and maintain detailed release schedules and milestones, taking into consideration <strong>regulatory requirements</strong>, user impact, and risk assessment. Ensure that all stages of the release are documented in compliance with <strong>medical device standards</strong>.</li><li><strong>Version Control &amp; Documentation:</strong> Manage version control systems and maintain accurate release notes, tracking changes and updates across multiple versions.</li><li><strong>Risk Management:</strong> Identify and mitigate risks in the release process, proactively addressing potential issues that could impact timelines, quality, or regulatory compliance.</li><li><strong>Process Improvement:</strong> Continuously improve release processes by identifying bottlenecks and optimize efficiency.</li><li><strong>Post-release Review &amp; Feedback</strong>: Coordinate feedback loops and post-release analysis to capture lessons learned, share insights, and refine future release processes.</li></ul><p><br></p><p><strong>Who you are:</strong></p><ul><li><strong>2+ years of experience </strong>in project management or release management within a regulated industry, ideally with a focus on mobile applications and medical devices.</li><li><strong>Strong project management skills</strong>: Excellent planning, organizational, and time management abilities, with a proven ability to manage multiple projects simultaneously.</li><li><strong>Exceptional communication skills</strong>: Comfortable providing frequent updates, managing stakeholder expectations, and working with cross-functional teams.</li><li><strong>Problem-solving mindset</strong>: Ability to handle complex release challenges and resolve issues in a time-sensitive environment.</li><li><strong>Technical Skills: </strong>Experience with mobile app development, deployment processes, and familiarity with version control systems. Knowledge of medical device software release requirements is a plus.</li><li>Experience in the <strong>medical device industry</strong> or with regulatory release processes is a plus.</li><li>Familiarity with <strong>Agile methodologies</strong> and experience using project management tools like Jira and Confluence.</li><li>Fluency in English, both written and spoken.</li></ul><p><br></p><p><strong>Bonus Skills:</strong></p><ul><li>Understanding of automated testing and quality assurance practices.</li><li>Familiarity with additional medical device regulations, such as FDA, ISO 13485, IEC 62304 for software development in medical devices.</li></ul><p><br></p><p>We are proud to be an equal opportunity employer. We provide employment opportunities without regard to age, race, color, ancestry, national origin, religion, disability, sex, gender identity or expression, sexual orientation, veteran status, or any other protected class.</p>\n        </div>\n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--more\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\" aria-label=\"i18n_show_more\" aria-expanded=\"false\">\n<!---->\n        \n            Show more\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/cyolgscd0imw2ldqppkrb84vo\"></icon>\n    </button>\n  \n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--less\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\" aria-label=\"i18n_show_less\" aria-expanded=\"true\">\n<!---->\n        \n            Show less\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/4chtt12k98xwnba1nimld2oyg\"></icon>\n    </button>\n  \n<!---->    </section>",
    "base_salary": {
      "min_amount": null,
      "max_amount": null,
      "currency": null,
      "payment_period": null
    },
    "timestamp": "2024-12-22T09:40:20.450Z",
    "input": {
      "url": "https://il.linkedin.com/jobs/view/release-manager-at-nanit-4106568004"
    }
  },
  {
    "url": "https://www.linkedin.com/jobs/view/senior-software-architect-at-applied-materials-israel-4107527107?lg=en",
    "job_posting_id": "4107527107",
    "job_title": "Senior Software Architect",
    "company_name": "Applied Materials - Israel",
    "company_id": "18865838",
    "job_location": "Center District, Israel",
    "job_summary": "We are looking for a highly motivated, talented Software Architecture that specialized in large & complex HW\\SW integrated systems to join our next generation system development team. What’s in it for you? Be a key player in the design one of the most sophisticated, complex systems, employing state-of-the-art technology. Leading to the best SW solution for a multidisciplinary system that built from SW, Algo, Physics, Motion, Mechanics, Electronics and Optics. Endless professional development possibilities Diverse career growth opportunities Our Group: Build and maintain the software infrastructures that autonomically controls and operate a state of the art , nano resolution scanning system. Composed from strong individuals, empowered, service minded SW engineers. Striving to make an impact and improve. Driven from business value, enable & partner with products teams. What you'll be doing: Be a part of a multidisciplinary team where teamwork and collaboration are key to success. Identify & research best-fit architectural solutions and technologies. Lead the architecture and design of a next generation system, provide regular support/guidance to project teams on complex coding, issue resolution and execution. Own technical backlog, including Innovation, Refactoring and Technical Debt. Interact with multiple stakeholders to understand, define and challenge requirements for breakthrough product/solutions. (scientist / product / field & system engineers) Work with teams across the globe to bring the best solution to the market Lead and groom fellow developers and tech leads We cherish and encourage hands on within all our Architecture Roles What you should have? BSc. or MSc. in Computer Engineering or Computer Science 12+ years of hands-on software engineering experience, at least 5 years with (Java/C#) Experience working in Linux, Windows, and k8 environments. Experience with all aspects of Software Architecture including design patterns, reliability, performance, volatility and observability. Experience deploying production-grade solution in non-cloud environment Experiences in technology research and technology selection Familiar with modern DevOps practice and ability to establish CI/CD process Knowledge and experience with semiconductor manufacturing equipment world - a big plus Ability to lead and mentor development teams Who we are? Applied Materials Israel is home to the Process Diagnostics and Control business unit (PDC). Based in Rehovot, we develop, manufacture and market cutting-edge machine learning and computer vision-based metrology and inspection products that are essential elements in wafer fabrication. By playing a significant role in enabling the production of the next generation of microchips, our expertise enables our customers to transform possibilities into reality. Show more Show less",
    "job_seniority_level": "Mid-Senior level",
    "job_function": "Engineering",
    "job_employment_type": "Full-time",
    "job_industries": "Semiconductor Manufacturing",
    "company_url": "https://il.linkedin.com/company/applied-materials-israel?trk=public_jobs_topcard-org-name",
    "job_posted_time": "1 hour ago",
    "job_num_applicants": 25,
    "discovery_input": {
      "url": "https://www.linkedin.com/jobs/search?keywords=Software&location=Tel%20Aviv-Yafo&geoId=101570771&trk=public_jobs_jobs-search-bar_search-submit&position=1&pageNum=0&f_TPR=r3600"
    },
    "apply_link": "https://www.linkedin.com/jobs/view/externalApply/4107527107?url=https%3A%2F%2Fcareers%2Eappliedmaterials%2Ecom%2Fcareers%2Fjob%2F790300318840&urlHash=rEEL",
    "country_code": null,
    "title_id": "332",
    "company_logo": "https://media.licdn.com/dms/image/v2/C4D0BAQFhTqtrxAuBSA/company-logo_100_100/company-logo_100_100/0/1634813562560/applied_materials_israel_logo?e=2147483647&v=beta&t=iIkkPfZPPuBZjopVT46OI4aJ9Pa2Jb0uj7I272mKnaY",
    "job_posted_date": "2024-12-22T08:40:27.530Z",
    "job_poster": {
      "name": "Hila Levy",
      "title": "Talent Acquisition Specialist at Applied Materials",
      "url": "https://il.linkedin.com/in/levyhila"
    },
    "application_availability": true,
    "job_description_formatted": "<section class=\"show-more-less-html\" data-max-lines=\"5\">\n        <div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <p>We are looking for a highly motivated, talented Software Architecture that specialized in large &amp; complex HW\\SW integrated systems to join our next generation system development team.</p><p><br></p><p><strong>What&#x2019;s in it for you?</strong></p><ul><li>Be a key player in the design one of the most sophisticated, complex systems, employing state-of-the-art technology.</li><li>Leading to the best SW solution for a multidisciplinary system that built from SW, Algo, Physics, Motion, Mechanics, Electronics and Optics.</li><li>Endless professional development possibilities</li><li>Diverse career growth opportunities</li></ul><p><br></p><p><strong>Our Group:</strong></p><ul><li>Build and maintain the software infrastructures that autonomically controls and operate a state of the art , nano resolution scanning system.</li><li>Composed from strong individuals, empowered, service minded SW engineers.</li><li>Striving to make an impact and improve.</li><li>Driven from business value, enable &amp; partner with products teams.</li></ul><p><br></p><p><br></p><p><strong>What you&apos;ll be doing:</strong></p><ul><li>Be a part of a multidisciplinary team where teamwork and collaboration are key to success.</li><li>Identify &amp; research best-fit architectural solutions and technologies.</li><li>Lead the architecture and design of a next generation system, provide regular support/guidance to project teams on complex coding, issue resolution and execution.</li><li>Own technical backlog, including Innovation, Refactoring and Technical Debt.</li><li>Interact with multiple stakeholders to understand, define and challenge requirements for breakthrough product/solutions. (scientist / product / field &amp; system engineers)</li><li>Work with teams across the globe to bring the best solution to the market</li><li>Lead and groom fellow developers and tech leads</li><li>We cherish and encourage hands on within all our Architecture Roles</li></ul><p><br></p><p><strong>What you should have?</strong></p><ul><li>BSc. or MSc. in Computer Engineering or Computer Science</li><li>12+ years of hands-on software engineering experience, at least 5 years with (Java/C#)</li><li>Experience working in Linux, Windows, and k8 environments.</li><li>Experience with all aspects of Software Architecture including design patterns, reliability, performance, volatility and observability.</li><li>Experience deploying production-grade solution in non-cloud environment</li><li>Experiences in technology research and technology selection</li><li>Familiar with modern DevOps practice and ability to establish CI/CD process</li><li>Knowledge and experience with semiconductor manufacturing equipment world - a big plus</li><li>Ability to lead and mentor development teams</li></ul><p><br></p><p><strong>Who we are?</strong></p><p><strong>Applied Materials Israel</strong> is home to the Process Diagnostics and Control business unit (PDC). Based in Rehovot, we develop, manufacture and market cutting-edge machine learning and computer vision-based metrology and inspection products that are essential elements in wafer fabrication. By playing a significant role in enabling the production of the next generation of microchips, our expertise enables our customers to transform possibilities into reality.</p>\n        </div>\n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--more\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\" aria-label=\"i18n_show_more\" aria-expanded=\"false\">\n<!---->\n        \n            Show more\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/cyolgscd0imw2ldqppkrb84vo\"></icon>\n    </button>\n  \n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--less\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\" aria-label=\"i18n_show_less\" aria-expanded=\"true\">\n<!---->\n        \n            Show less\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/4chtt12k98xwnba1nimld2oyg\"></icon>\n    </button>\n  \n<!---->    </section>",
    "base_salary": {
      "min_amount": null,
      "max_amount": null,
      "currency": null,
      "payment_period": null
    },
    "timestamp": "2024-12-22T09:40:27.552Z",
    "input": {
      "url": "https://il.linkedin.com/jobs/view/senior-software-architect-at-applied-materials-israel-4107527107"
    }
  },
  {
    "url": "https://www.linkedin.com/jobs/view/c%2B%2B-developer-at-logica-it-4106560741?lg=en",
    "job_posting_id": "4106560741",
    "job_title": "C++ Developer",
    "company_name": "Logica-IT",
    "company_id": "1900514",
    "job_location": "Rosh HaAyin, Center District, Israel",
    "job_summary": "לחברה גלובלית ומצליחה במרכז הארץ, דרוש/ה Software C++ Developer. משרה מלאה וקבועה בראש העין, קיימת אפשרות של עבודה מהבית. הזדמנות להיכנס לתפקיד עם שפע של אתגר ועניין, הצטרפות לצוות מנצח, סביבת עבודה מקצועית ונעימה, תנאים מעולים! דרישות התפקיד 5 שנות ניסיון ומעלה בפיתוח תשתיות תוכנה בשפת C++ ניסיון מוכח בפיתוח של מערכות תוכנה (Software) – חובה. (חומרה או Embedded – לא מתאים). ניסיון מוכח בתכנון, פיתוח ותחזוקה של מערכות Back-End מבוזרות – חובה. ניסיון מוכח עם בסיס הנתונים מסוג SQL Server או אחר דומה – חובה. ידע או ניסיון עם ארכיטקטורה וכתיבה של מסמכי אפיון – יתרון. ידע או ניסיון עם ERP Priority – יתרון. ידע או ניסיון עם שפת Go – יתרון. ידע או ניסיון עם ענן ציבורי מסוג AWS – יתרון. Show more Show less",
    "job_seniority_level": "Mid-Senior level",
    "job_function": "Engineering",
    "job_employment_type": "Full-time",
    "job_industries": "Software Development",
    "company_url": "https://il.linkedin.com/company/logica-it?trk=public_jobs_topcard-org-name",
    "job_posted_time": "30 minutes ago",
    "job_num_applicants": 25,
    "discovery_input": {
      "url": "https://www.linkedin.com/jobs/search?keywords=Software&location=Tel%20Aviv-Yafo&geoId=101570771&trk=public_jobs_jobs-search-bar_search-submit&position=1&pageNum=0&f_TPR=r3600"
    },
    "apply_link": null,
    "country_code": null,
    "title_id": "9",
    "company_logo": "https://media.licdn.com/dms/image/v2/D4D0BAQFvt8vkiy0P6w/company-logo_100_100/company-logo_100_100/0/1688542225506/logica_it_logo?e=2147483647&v=beta&t=1U5DUUmcghHEkJmabP9ONy-7RVJClPH2krNWZgXbaDs",
    "job_posted_date": "2024-12-22T09:10:36.209Z",
    "job_poster": {
      "name": null,
      "title": null,
      "url": null
    },
    "application_availability": true,
    "job_description_formatted": "<section class=\"show-more-less-html\" data-max-lines=\"5\">\n        <div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <p>&#x5DC;&#x5D7;&#x5D1;&#x5E8;&#x5D4; &#x5D2;&#x5DC;&#x5D5;&#x5D1;&#x5DC;&#x5D9;&#x5EA; &#x5D5;&#x5DE;&#x5E6;&#x5DC;&#x5D9;&#x5D7;&#x5D4; &#x5D1;&#x5DE;&#x5E8;&#x5DB;&#x5D6; &#x5D4;&#x5D0;&#x5E8;&#x5E5;, &#x5D3;&#x5E8;&#x5D5;&#x5E9;/&#x5D4; Software C++ Developer.</p><p>&#x5DE;&#x5E9;&#x5E8;&#x5D4; &#x5DE;&#x5DC;&#x5D0;&#x5D4; &#x5D5;&#x5E7;&#x5D1;&#x5D5;&#x5E2;&#x5D4; &#x5D1;&#x5E8;&#x5D0;&#x5E9; &#x5D4;&#x5E2;&#x5D9;&#x5DF;, &#x5E7;&#x5D9;&#x5D9;&#x5DE;&#x5EA; &#x5D0;&#x5E4;&#x5E9;&#x5E8;&#x5D5;&#x5EA; &#x5E9;&#x5DC; &#x5E2;&#x5D1;&#x5D5;&#x5D3;&#x5D4; &#x5DE;&#x5D4;&#x5D1;&#x5D9;&#x5EA;.</p><p>&#x5D4;&#x5D6;&#x5D3;&#x5DE;&#x5E0;&#x5D5;&#x5EA; &#x5DC;&#x5D4;&#x5D9;&#x5DB;&#x5E0;&#x5E1; &#x5DC;&#x5EA;&#x5E4;&#x5E7;&#x5D9;&#x5D3; &#x5E2;&#x5DD; &#x5E9;&#x5E4;&#x5E2; &#x5E9;&#x5DC; &#x5D0;&#x5EA;&#x5D2;&#x5E8; &#x5D5;&#x5E2;&#x5E0;&#x5D9;&#x5D9;&#x5DF;, &#x5D4;&#x5E6;&#x5D8;&#x5E8;&#x5E4;&#x5D5;&#x5EA; &#x5DC;&#x5E6;&#x5D5;&#x5D5;&#x5EA; &#x5DE;&#x5E0;&#x5E6;&#x5D7;, &#x5E1;&#x5D1;&#x5D9;&#x5D1;&#x5EA; &#x5E2;&#x5D1;&#x5D5;&#x5D3;&#x5D4; &#x5DE;&#x5E7;&#x5E6;&#x5D5;&#x5E2;&#x5D9;&#x5EA; &#x5D5;&#x5E0;&#x5E2;&#x5D9;&#x5DE;&#x5D4;, &#x5EA;&#x5E0;&#x5D0;&#x5D9;&#x5DD; &#x5DE;&#x5E2;&#x5D5;&#x5DC;&#x5D9;&#x5DD;!</p><p></p><p><strong><u>&#x5D3;&#x5E8;&#x5D9;&#x5E9;&#x5D5;&#x5EA; &#x5D4;&#x5EA;&#x5E4;&#x5E7;&#x5D9;&#x5D3; </u></strong></p><ul><li>5 &#x5E9;&#x5E0;&#x5D5;&#x5EA; &#x5E0;&#x5D9;&#x5E1;&#x5D9;&#x5D5;&#x5DF; &#x5D5;&#x5DE;&#x5E2;&#x5DC;&#x5D4; &#x5D1;&#x5E4;&#x5D9;&#x5EA;&#x5D5;&#x5D7; &#x5EA;&#x5E9;&#x5EA;&#x5D9;&#x5D5;&#x5EA; &#x5EA;&#x5D5;&#x5DB;&#x5E0;&#x5D4; &#x5D1;&#x5E9;&#x5E4;&#x5EA; C++ </li><li>&#x5E0;&#x5D9;&#x5E1;&#x5D9;&#x5D5;&#x5DF; &#x5DE;&#x5D5;&#x5DB;&#x5D7; &#x5D1;&#x5E4;&#x5D9;&#x5EA;&#x5D5;&#x5D7; &#x5E9;&#x5DC; &#x5DE;&#x5E2;&#x5E8;&#x5DB;&#x5D5;&#x5EA; &#x5EA;&#x5D5;&#x5DB;&#x5E0;&#x5D4; (Software) &#x2013; &#x5D7;&#x5D5;&#x5D1;&#x5D4;. (&#x5D7;&#x5D5;&#x5DE;&#x5E8;&#x5D4; &#x5D0;&#x5D5; Embedded &#x2013; &#x5DC;&#x5D0; &#x5DE;&#x5EA;&#x5D0;&#x5D9;&#x5DD;). </li><li>&#x5E0;&#x5D9;&#x5E1;&#x5D9;&#x5D5;&#x5DF; &#x5DE;&#x5D5;&#x5DB;&#x5D7; &#x5D1;&#x5EA;&#x5DB;&#x5E0;&#x5D5;&#x5DF;, &#x5E4;&#x5D9;&#x5EA;&#x5D5;&#x5D7; &#x5D5;&#x5EA;&#x5D7;&#x5D6;&#x5D5;&#x5E7;&#x5D4; &#x5E9;&#x5DC; &#x5DE;&#x5E2;&#x5E8;&#x5DB;&#x5D5;&#x5EA; Back-End &#x5DE;&#x5D1;&#x5D5;&#x5D6;&#x5E8;&#x5D5;&#x5EA; &#x2013; &#x5D7;&#x5D5;&#x5D1;&#x5D4;. </li><li>&#x5E0;&#x5D9;&#x5E1;&#x5D9;&#x5D5;&#x5DF; &#x5DE;&#x5D5;&#x5DB;&#x5D7; &#x5E2;&#x5DD; &#x5D1;&#x5E1;&#x5D9;&#x5E1; &#x5D4;&#x5E0;&#x5EA;&#x5D5;&#x5E0;&#x5D9;&#x5DD; &#x5DE;&#x5E1;&#x5D5;&#x5D2; SQL Server &#x5D0;&#x5D5; &#x5D0;&#x5D7;&#x5E8; &#x5D3;&#x5D5;&#x5DE;&#x5D4; &#x2013; &#x5D7;&#x5D5;&#x5D1;&#x5D4;. </li><li>&#x5D9;&#x5D3;&#x5E2; &#x5D0;&#x5D5; &#x5E0;&#x5D9;&#x5E1;&#x5D9;&#x5D5;&#x5DF; &#x5E2;&#x5DD; &#x5D0;&#x5E8;&#x5DB;&#x5D9;&#x5D8;&#x5E7;&#x5D8;&#x5D5;&#x5E8;&#x5D4; &#x5D5;&#x5DB;&#x5EA;&#x5D9;&#x5D1;&#x5D4; &#x5E9;&#x5DC; &#x5DE;&#x5E1;&#x5DE;&#x5DB;&#x5D9; &#x5D0;&#x5E4;&#x5D9;&#x5D5;&#x5DF; &#x2013; &#x5D9;&#x5EA;&#x5E8;&#x5D5;&#x5DF;. </li><li>&#x5D9;&#x5D3;&#x5E2; &#x5D0;&#x5D5; &#x5E0;&#x5D9;&#x5E1;&#x5D9;&#x5D5;&#x5DF; &#x5E2;&#x5DD; ERP Priority &#x2013; &#x5D9;&#x5EA;&#x5E8;&#x5D5;&#x5DF;. </li><li>&#x5D9;&#x5D3;&#x5E2; &#x5D0;&#x5D5; &#x5E0;&#x5D9;&#x5E1;&#x5D9;&#x5D5;&#x5DF; &#x5E2;&#x5DD; &#x5E9;&#x5E4;&#x5EA; Go &#x2013; &#x5D9;&#x5EA;&#x5E8;&#x5D5;&#x5DF;. </li><li>&#x5D9;&#x5D3;&#x5E2; &#x5D0;&#x5D5; &#x5E0;&#x5D9;&#x5E1;&#x5D9;&#x5D5;&#x5DF; &#x5E2;&#x5DD; &#x5E2;&#x5E0;&#x5DF; &#x5E6;&#x5D9;&#x5D1;&#x5D5;&#x5E8;&#x5D9; &#x5DE;&#x5E1;&#x5D5;&#x5D2; AWS &#x2013; &#x5D9;&#x5EA;&#x5E8;&#x5D5;&#x5DF;.</li></ul><p></p>\n        </div>\n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--more\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\" aria-label=\"i18n_show_more\" aria-expanded=\"false\">\n<!---->\n        \n            Show more\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/cyolgscd0imw2ldqppkrb84vo\"></icon>\n    </button>\n  \n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--less\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\" aria-label=\"i18n_show_less\" aria-expanded=\"true\">\n<!---->\n        \n            Show less\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/4chtt12k98xwnba1nimld2oyg\"></icon>\n    </button>\n  \n<!---->    </section>",
    "base_salary": {
      "min_amount": null,
      "max_amount": null,
      "currency": null,
      "payment_period": null
    },
    "timestamp": "2024-12-22T09:40:36.229Z",
    "input": {
      "url": "https://il.linkedin.com/jobs/view/c%2B%2B-developer-at-logica-it-4106560741"
    }
  },
  {
    "url": "https://www.linkedin.com/jobs/view/data-engineer-at-bondit-4108008391?lg=en",
    "job_posting_id": "4108008391",
    "job_title": "Data Engineer",
    "company_name": "bondIT",
    "company_id": "3222746",
    "job_location": "Herzliya, Tel Aviv District, Israel",
    "job_summary": "bondIT Global is an independent provider of portfolio construction technology and credit analysis for fixed income. It brings together data science, AI, software, and fintech expertise to empower today’s portfolio manager and financial advisors. We have offices in Herzliya (Israel), Berlin, New York, and London. We are looking for a Data Engineer to join our R&D group to build and develop our evolving data platform. What You'll Do: Data Pipeline Development: Design, develop, and maintain scalable and efficient data pipelines to support business needs. ETL Processes: Implement and optimize complex ETL processes to ingest data from multiple sources, including vendor market data, client market data, and external/internal APIs. Data Knowledge: Work closely with data scientists and product teams to understand data requirements and deliver impactful data solutions. Data Quality Assurance: Ensure data accuracy and quality through validation, testing, and best practices. What We're Looking For: Education : Bachelor's degree in computer science, Information Systems, or a related field. Python Experience: 3+ years of experience in Python for data process development. ETL Experience: 3+ years of experience in ETL development and querying data warehouses to support applications that are used by external clients. DB Experience: 2+ years of experience working with databases, such as MySQL. Technical Skills : Familiarity with Linux environments. Collaboration: Strong team player with excellent communication skills. Preferred Qualifications: Cloud Expertise: Experience with cloud environments, preferably AWS. Analytical Databases: Familiarity with analytical databases like ClickHouse and/or Snowflake. Pipeline Tools: Experience with pipeline tools such as River, Dagger, Airbyte, or Airflow. Domain Knowledge: Understanding of fixed-income data is a plus. What you will gain during your time with us: Working for a leading Fintech startup with advanced technologies in a micro-services architecture Diverse activities and autonomous implementation of own ideas in a dynamic environment Hybrid working model and an attractive salary Generous learning and development budget At bondIT, we are committed to providing an environment of mutual respect where equal employment opportunities are available to all applicants and teammates without regard to race, color, religion, sex, national origin, age, physical and mental disability, or sexual orientation. Show more Show less",
    "job_seniority_level": "Mid-Senior level",
    "job_function": "Information Technology",
    "job_employment_type": "Full-time",
    "job_industries": "IT Services and IT Consulting",
    "company_url": "https://il.linkedin.com/company/bondit?trk=public_jobs_topcard-org-name",
    "job_posted_time": "27 minutes ago",
    "job_num_applicants": 25,
    "discovery_input": {
      "url": "https://www.linkedin.com/jobs/search?keywords=Software&location=Tel%20Aviv-Yafo&geoId=101570771&trk=public_jobs_jobs-search-bar_search-submit&position=1&pageNum=0&f_TPR=r3600"
    },
    "apply_link": "https://www.linkedin.com/jobs/view/externalApply/4108008391?url=https%3A%2F%2Fbonditglobal%2Erecruitee%2Ecom%2Fo%2Fdata-engineer&urlHash=4QwB",
    "country_code": null,
    "title_id": "2732",
    "company_logo": "https://media.licdn.com/dms/image/v2/C4E0BAQGpDJEm0NYaPA/company-logo_100_100/company-logo_100_100/0/1653650668623/bondit_logo?e=2147483647&v=beta&t=mTuKO69JP31dbN496X2R4iS0aPdkXyzrjX974vLj09A",
    "job_posted_date": "2024-12-22T09:13:39.688Z",
    "job_poster": {
      "name": "Tamar Itzkovich 🎗",
      "title": "Recruiting Manager ⭐️HR Account Manager ⭐️ Global Recruiting ⭐️ Senior Talent Acquisition ⭐️ Sourcing ⭐️ Organization Development ⭐️ Digital…",
      "url": "https://il.linkedin.com/in/tamar-itzkovich"
    },
    "application_availability": true,
    "job_description_formatted": "<section class=\"show-more-less-html\" data-max-lines=\"5\">\n        <div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <p>bondIT Global is an independent provider of portfolio construction technology and credit analysis for fixed income. It brings together data science, AI, software, and fintech expertise to empower today&#x2019;s portfolio manager and financial advisors.&#xA0;</p><p>We have offices in Herzliya (Israel), Berlin, New York, and London.</p><p><br></p><p>We are looking for a Data Engineer to join our R&amp;D group to build and develop our evolving data platform.</p><p><br></p><p><strong><u>What You&apos;ll Do:</u></strong></p><ul><li><strong>Data Pipeline Development:&#xA0;</strong>Design, develop, and maintain scalable and efficient data pipelines to support business needs.</li><li><strong>ETL Processes:&#xA0;</strong>Implement and optimize complex ETL processes to ingest data from multiple sources, including vendor market data, client market data, and external/internal APIs.</li><li><strong>Data Knowledge:&#xA0;</strong>Work closely with data scientists and product teams to understand data requirements and deliver impactful data solutions.</li><li><strong>Data Quality Assurance:</strong>&#xA0;Ensure data accuracy and quality through validation, testing, and best practices.</li></ul><p><br></p><p><strong><u>What We&apos;re Looking For:</u></strong></p><ul><li><strong>Education</strong>: Bachelor&apos;s degree in computer science, Information Systems, or a related field.</li><li><strong>Python Experience:&#xA0;</strong>3+ years of experience in Python for data process development.</li><li><strong>ETL Experience:&#xA0;</strong>3+ years of experience in ETL development and querying data warehouses to support applications that are used by external clients.</li><li><strong>DB Experience:&#xA0;</strong>2+ years of experience working with databases, such as MySQL.</li><li><strong>Technical Skills</strong>: Familiarity with Linux environments.</li><li><strong>Collaboration:&#xA0;</strong>Strong team player with excellent communication skills.</li></ul><p><br></p><p><strong><u>Preferred Qualifications:</u></strong></p><ul><li><strong>Cloud Expertise:&#xA0;</strong>Experience with cloud environments, preferably AWS.</li><li><strong>Analytical Databases:&#xA0;</strong>Familiarity with analytical databases like ClickHouse and/or Snowflake.</li><li><strong>Pipeline Tools:&#xA0;</strong>Experience with pipeline tools such as River, Dagger, Airbyte, or Airflow.</li><li><strong>Domain Knowledge:&#xA0;</strong>Understanding of fixed-income data is a plus.</li></ul><p><br></p><p><strong><u>What you will gain during your time with us:</u></strong></p><ul><li>Working for a leading Fintech startup with advanced technologies in a micro-services architecture</li><li>Diverse activities and autonomous implementation of own ideas in a dynamic environment</li><li>Hybrid working model and an attractive salary</li><li>Generous learning and development budget</li></ul><p><br></p><p><br></p><p><strong>At bondIT, we are committed to providing an environment of mutual respect where equal employment opportunities are available to all applicants and teammates without regard to race, color, religion, sex, national origin, age, physical and mental disability, or sexual orientation.</strong></p><p><br></p>\n        </div>\n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--more\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\" aria-label=\"i18n_show_more\" aria-expanded=\"false\">\n<!---->\n        \n            Show more\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/cyolgscd0imw2ldqppkrb84vo\"></icon>\n    </button>\n  \n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--less\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\" aria-label=\"i18n_show_less\" aria-expanded=\"true\">\n<!---->\n        \n            Show less\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/4chtt12k98xwnba1nimld2oyg\"></icon>\n    </button>\n  \n<!---->    </section>",
    "base_salary": {
      "min_amount": null,
      "max_amount": null,
      "currency": null,
      "payment_period": null
    },
    "timestamp": "2024-12-22T09:40:39.708Z",
    "input": {
      "url": "https://il.linkedin.com/jobs/view/data-engineer-at-bondit-4108008391"
    }
  },
  {
    "url": "https://www.linkedin.com/jobs/view/senior-backend-engineer%E2%80%93%E2%80%AFazure-video-indexer%E2%80%AFgroup%E2%80%AF-at-microsoft-4107999197?lg=en",
    "job_posting_id": "4107999197",
    "job_title": "Senior Backend Engineer– Azure Video Indexer Group",
    "company_name": "Microsoft",
    "company_id": "1035",
    "job_location": "Herzliya, Tel Aviv District, Israel",
    "job_summary": "Azure Video Indexer (https://vi.microsoft.com) group is looking for Senior backend Engineer. As a mature cloud and edge offering, Video Indexer deliver multiple microservices to our customers on a weekly basis. We’re looking for capable developers to expedite our delivery, automate and secure our deliveries and collaborate across the FE, DS and BE team building best in class infrastructure. Responsibilities Design, Implement and maintain core backend software components. Building CI / CD pipelines and automations for cloud native infrastructure. Automating machine learning models training, deployment and delivery. Ensure compliance, data-quality monitoring, and data governance on Video indexer platform. Analyze and improve efficiency, scalability, and stability of various system resources. Share knowledge with other team members and promote engineering excellence. Qualifications Requirements for the position: B.Sc. in Computer Science or equivalent 6+ years of experience in cloud development on Azure / AWS / GCP. 6+ years of technical engineering experience with coding in languages including, but not limited to, C#, Java or C++ Relevant experience in scripting languages such as Python or javascript. Relevant experience in building large-scale infrastructure applications. Experience in content delivery pipelines such as Azure DevOps or equivalent. Experience with K8S and Linux The role requires a very high level of independence and experience in corporate work, Passion to automate and implement robust processes. Outstanding team player with strong communication skills Independent, capable of making decisions in an ambiguous environment Demonstrated ability to think creatively and being resilient to changes Microsoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations. Show more Show less",
    "job_seniority_level": "Not Applicable",
    "job_function": "Engineering and Information Technology",
    "job_employment_type": "Full-time",
    "job_industries": "Software Development",
    "company_url": "https://www.linkedin.com/company/microsoft?trk=public_jobs_topcard-org-name",
    "job_posted_time": "1 hour ago",
    "job_num_applicants": 25,
    "discovery_input": {
      "url": "https://www.linkedin.com/jobs/search?keywords=Software&location=Tel%20Aviv-Yafo&geoId=101570771&trk=public_jobs_jobs-search-bar_search-submit&position=1&pageNum=0&f_TPR=r3600"
    },
    "apply_link": "https://www.linkedin.com/jobs/view/externalApply/4107999197?url=https%3A%2F%2Fcareers%2Emicrosoft%2Ecom%2Fus%2Fen%2Fjob%2F1794555%2FSenior-Backend-Engineer-Azure-Video-Indexer-Group-%3Fjobsource%3Dlinkedin%26utm_source%3DJob%2520Board%26utm_campaign%3Dlinkedin-feed&urlHash=NuDU",
    "country_code": null,
    "title_id": "25194",
    "company_logo": "https://media.licdn.com/dms/image/v2/C560BAQE88xCsONDULQ/company-logo_100_100/company-logo_100_100/0/1630652622688/microsoft_logo?e=2147483647&v=beta&t=lMkCSsceJNmUG1r0VRg3Whye1sVi2KtYvt-MWyfoNbY",
    "job_posted_date": "2024-12-22T08:40:54.525Z",
    "job_poster": {
      "name": null,
      "title": null,
      "url": null
    },
    "application_availability": true,
    "job_description_formatted": "<section class=\"show-more-less-html\" data-max-lines=\"5\">\n        <div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          Azure Video Indexer (https://vi.microsoft.com) group is looking for Senior backend Engineer.&#x202F;As a mature cloud and edge offering, Video Indexer deliver multiple microservices to our customers on a weekly basis. We&#x2019;re looking for capable developers to expedite our delivery, automate and secure our deliveries and collaborate across the FE, DS and BE team building best in class infrastructure.<br><br><strong>Responsibilities<br><br></strong><ul><li>Design, Implement and maintain core backend software components. </li><li>Building CI / CD pipelines and automations for cloud native infrastructure. </li><li>Automating machine learning models training, deployment and delivery. </li><li>Ensure compliance, data-quality monitoring, and data governance on Video indexer platform. </li><li>Analyze and improve efficiency, scalability, and stability of various system resources. </li><li>Share knowledge with other team members and promote engineering excellence. <br><br></li></ul><strong>Qualifications<br><br></strong>Requirements for the position:&#x202F;<br><br><ul><li>B.Sc. in Computer Science or equivalent&#x202F; </li><li>6+ years of experience in cloud development on Azure / AWS / GCP. </li><li>6+ years of technical engineering experience with coding in languages including, but not limited to, C#, Java or C++</li><li>Relevant experience in scripting languages such as Python or javascript. </li><li>Relevant experience in building large-scale infrastructure applications.</li><li>Experience in content delivery pipelines such as Azure DevOps or equivalent. </li><li>Experience with K8S and Linux </li><li>The role requires a very high level of independence and experience in corporate work, Passion to automate and implement robust processes. </li><li>Outstanding&#x202F;team player with strong communication skills&#x202F; </li><li>Independent, capable of making decisions in an ambiguous&#x202F;environment&#x202F; </li><li>Demonstrated ability to think creatively and being resilient to changes&#x202F; <br><br></li></ul>Microsoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.\n        </div>\n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--more\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\" aria-label=\"i18n_show_more\" aria-expanded=\"false\">\n<!---->\n        \n            Show more\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/cyolgscd0imw2ldqppkrb84vo\"></icon>\n    </button>\n  \n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--less\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\" aria-label=\"i18n_show_less\" aria-expanded=\"true\">\n<!---->\n        \n            Show less\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/4chtt12k98xwnba1nimld2oyg\"></icon>\n    </button>\n  \n<!---->    </section>",
    "base_salary": {
      "min_amount": null,
      "max_amount": null,
      "currency": null,
      "payment_period": null
    },
    "timestamp": "2024-12-22T09:40:54.567Z",
    "input": {
      "url": "https://il.linkedin.com/jobs/view/senior-backend-engineer%E2%80%93%E2%80%AFazure-video-indexer%E2%80%AFgroup%E2%80%AF-at-microsoft-4107999197"
    }
  },
  {
    "url": "https://www.linkedin.com/jobs/view/sr-cybersecurity-threat-intelligence-engineer-at-stratasys-4108012137?lg=en",
    "job_posting_id": "4108012137",
    "job_title": "Sr. Cybersecurity Threat Intelligence Engineer",
    "company_name": "Stratasys",
    "company_id": "415728",
    "job_location": "Rehovot, Center District, Israel",
    "job_summary": "Stratasys is a world leader in 3D printing! Stratasys is leading the global shift to additive manufacturing with innovative 3D printing solutions for industries such as aerospace, automotive, consumer products and healthcare. Through smart and connected 3D printers, polymer materials, a software ecosystem, and parts on demand, Stratasys solutions deliver competitive advantages at every stage in the product value chain. The world’s leading organizations turn to Stratasys to transform product design, bring agility to manufacturing and supply chains, and improve patient care. We are seeking an experienced Senior Cybersecurity Threat Hunter to join our Information Security team. This senior-level role is critical in leading proactive threat hunting, vulnerability mitigation, digital forensics, and incident response (DFIR) efforts to safeguard our organization’s infrastructure. The ideal candidate will have extensive expertise in identifying and mitigating advanced cyber threats, related to Identity, Data, Device & Application. conducting in-depth forensic analysis and driving risk-reduction initiatives across the organization. As a senior member of the team, you will mentor junior staff, set strategic directions for threat detection, and play a pivotal role in enhancing our security posture. Key Responsibilities Advanced Threat Hunting : Lead proactive threat hunting initiatives to detect sophisticated cyber threats, attack vectors, and vulnerabilities across all environments (on-premises, cloud, hybrid). Optimize & Secure : Ensure security improvements of Microsoft 365 platforms. Conduct regular audits to monitor and optimize the security posture of MS 365 Defender platforms. Risk Reduction Strategy : Analyze organizational risk from emerging threats, providing strategic recommendations and working cross-functionally to implement effective mitigation strategies that reduce exposure to cyberattacks. Mentorship & Leadership : Train junior threat hunters and cybersecurity staff, helping to develop team capabilities and improving overall security intelligence. Incident Investigation : participate in high-priority investigations, utilizing advanced analysis techniques to assess the scope and impact of incidents, determine threat actor tactics, and recommend actionable response measures. Threat Intelligence Integration : Utilize advanced threat intelligence platforms and external sources to enhance threat detection and anticipate evolving attack techniques. Implement threat intelligence into detection strategies and mitigation plans. Security Tools & Forensic Techniques : Drive the configuration, customization, and optimization of security tools, including SIEM, EDR solutions, and forensic platforms, to improve the team’s ability to detect and respond to threats. Strategic Reporting & Documentation : Develop and present reports of threat trends, findings and improvements. Cross-Department Collaboration : Work closely with IT, DevOps, Security and other business units to ensure proactive Cybersecurity threats mitigation and security posture improvements share knowledge on security risks and mitigations. Process Improvement : Lead continuous improvement efforts in threat hunting methodologies, forensic analysis techniques. Stay updated on the latest cybersecurity trends and technologies to ensure cutting-edge threat detection and defense. Qualifications & Skills Education : Bachelor’s degree in Cybersecurity, Computer Science, Information Technology, or a related field or equivalent experience. Experience : At least 6 years of experience in IT Infrastructure, Systems & Network Administrator, and Proven experience as a Microsoft 365 Engineer/Architect and Global Tenant admin 3 years of experience in Information Security/Cybersecurity domain in threat hunting, analysis & security engineering. Advanced Technical Proficiency : Deep understanding of Microsoft 365 security suite, including Defender, Entra ID, MS Purview, Azure Security, SSO, OneDrive, Teams, SharePoint, and Power Automate. Comprehensive knowledge of Microsoft 365 technical architecture and interdependencies with other enterprise services. Deep knowledge in networking, specifically OSI/TCP IP model and protocols. Extensive knowledge of security technologies, including firewalls, endpoint protection, SIEM, and vulnerability management tools including logs and forensics analysis. PowerShell Proficiency: Advanced skills in PowerShell scripting for automation and management and response actions. Experience with cloud security (AWS, Azure, Google Cloud) and hybrid environments. Windows/RHEL security knowledge- advantage Familiar with CIS benchmarks/ hardening guidelines- Advantage Can-do attitude, customer-facing, accountable, positive attitude, and time management skills. Team player, confident, independent, and enthusiastic Excellent communication skills & excellent English (speaking, reading, and writing) Certifications (preferred) : MS 365 Security certifications or equivalent to: Certified Ethical Hacker (CEH) Certified Information Systems Auditor (CISA) Certified Cyber Threat Hunter (CCTH) Certified Information Systems Security Professional (CISSP) Offensive Security Certified Professional (OSCP) Certified Expert in Threat Intelligence (GCTI) What​ ​you​ ​will​ ​be​ ​part​ ​of: Company Overview - https://www.stratasys.com/en/about-us/history/ Our Culture and Values - https://www.stratasys.com/en/about-us/culture/ Our Sustainability “3D Printing a Better Tomorrow” - https://www.stratasys.com/en/about-us/sustainability/ Our Locations - https://www.stratasys.com/en/contact-us/office-locations/ Check out our Video - https://www.youtube.com/watch?v=6wmDfmt2bNI Show more Show less",
    "job_seniority_level": "Mid-Senior level",
    "job_function": "Information Technology",
    "job_employment_type": "Full-time",
    "job_industries": "Industrial Machinery Manufacturing",
    "company_url": "https://il.linkedin.com/company/stratasys?trk=public_jobs_topcard-org-name",
    "job_posted_time": "4 minutes ago",
    "job_num_applicants": 25,
    "discovery_input": {
      "url": "https://www.linkedin.com/jobs/search?keywords=Software&location=Tel%20Aviv-Yafo&geoId=101570771&trk=public_jobs_jobs-search-bar_search-submit&position=1&pageNum=0&f_TPR=r3600"
    },
    "apply_link": "https://www.linkedin.com/jobs/view/externalApply/4108012137?url=https%3A%2F%2Fcareers%2Estratasys%2Ecom%2Fjob-invite%2F54051%2F&urlHash=ioDw",
    "country_code": null,
    "title_id": "31449",
    "company_logo": "https://media.licdn.com/dms/image/v2/D4D0BAQGrkFCWrr1gkg/company-logo_100_100/company-logo_100_100/0/1719851425351/stratasys_logo?e=2147483647&v=beta&t=Hj_nEsbBvX9leWDomiJpii2WM_uEEYmknnQihSWd4hk",
    "job_posted_date": "2024-12-22T09:37:18.580Z",
    "job_poster": {
      "name": null,
      "title": null,
      "url": null
    },
    "application_availability": true,
    "job_description_formatted": "<section class=\"show-more-less-html\" data-max-lines=\"5\">\n        <div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <p><strong>Stratasys is a world leader in 3D printing!</strong></p><p><strong>Stratasys</strong> is leading the global shift to additive manufacturing with innovative 3D printing solutions for industries such as aerospace, automotive, consumer products and healthcare. Through smart and connected 3D printers, polymer materials, a software ecosystem, and parts on demand, Stratasys solutions deliver competitive advantages at every stage in the product value chain. The world&#x2019;s leading organizations turn to Stratasys to transform product design, bring agility to manufacturing and supply chains, and improve patient care.</p><p><br></p><p>We are seeking an experienced Senior Cybersecurity Threat Hunter to join our Information Security team. This senior-level role is critical in leading proactive threat hunting, vulnerability mitigation, digital forensics, and incident response (DFIR) efforts to safeguard our organization&#x2019;s infrastructure. The ideal candidate will have extensive expertise in identifying and mitigating advanced cyber threats, related to Identity, Data, Device &amp; Application. conducting in-depth forensic analysis and driving risk-reduction initiatives across the organization. As a senior member of the team, you will mentor junior staff, set strategic directions for threat detection, and play a pivotal role in enhancing our security posture.</p><p><br></p><p><strong>Key Responsibilities</strong></p><ul><li><strong>Advanced Threat Hunting</strong>: Lead proactive threat hunting initiatives to detect sophisticated cyber threats, attack vectors, and vulnerabilities across all environments (on-premises, cloud, hybrid).</li><li><strong>Optimize &amp; Secure</strong>: Ensure security improvements of Microsoft 365 platforms. Conduct regular audits to monitor and optimize the security posture of MS 365 Defender platforms.</li><li><strong>Risk Reduction Strategy</strong>: Analyze organizational risk from emerging threats, providing strategic recommendations and working cross-functionally to implement effective mitigation strategies that reduce exposure to cyberattacks.</li><li><strong>Mentorship &amp; Leadership</strong>: Train junior threat hunters and cybersecurity staff, helping to develop team capabilities and improving overall security intelligence.</li><li><strong>Incident Investigation</strong>: participate in high-priority investigations, utilizing advanced analysis techniques to assess the scope and impact of incidents, determine threat actor tactics, and recommend actionable response measures.</li><li><strong>Threat Intelligence Integration</strong>: Utilize advanced threat intelligence platforms and external sources to enhance threat detection and anticipate evolving attack techniques. Implement threat intelligence into detection strategies and mitigation plans.</li><li><strong>Security Tools &amp; Forensic Techniques</strong>: Drive the configuration, customization, and optimization of security tools, including SIEM, EDR solutions, and forensic platforms, to improve the team&#x2019;s ability to detect and respond to threats.</li><li><strong>Strategic Reporting &amp; Documentation</strong>: Develop and present reports of threat trends, findings and improvements.</li><li><strong>Cross-Department Collaboration</strong>: Work closely with IT, DevOps, Security and other business units to ensure proactive Cybersecurity threats mitigation and security posture improvements share knowledge on security risks and mitigations.</li><li><strong>Process Improvement</strong>: Lead continuous improvement efforts in threat hunting methodologies, forensic analysis techniques. Stay updated on the latest cybersecurity trends and technologies to ensure cutting-edge threat detection and defense.</li></ul><p><br></p><p><strong>Qualifications &amp; Skills</strong></p><ul><li><strong>Education</strong>: Bachelor&#x2019;s degree in Cybersecurity, Computer Science, Information Technology, or a related field or equivalent experience.</li><li><strong>Experience</strong>:</li><li>At least 6 years of experience in IT Infrastructure, Systems &amp; Network Administrator, and Proven experience as a Microsoft 365 Engineer/Architect and Global Tenant admin</li><li>3 years of experience in Information Security/Cybersecurity domain in threat hunting, analysis &amp; security engineering.</li><li><strong>Advanced Technical Proficiency</strong>:</li><li>Deep understanding of Microsoft 365 security suite, including Defender, Entra ID, MS Purview, Azure Security, SSO, OneDrive, Teams, SharePoint, and Power Automate.</li><li>Comprehensive knowledge of Microsoft 365 technical architecture and interdependencies with other enterprise services.</li><li>Deep knowledge in networking, specifically OSI/TCP IP model and protocols.</li><li>Extensive knowledge of security technologies, including firewalls, endpoint protection, SIEM, and vulnerability management tools including logs and forensics analysis.</li><li>PowerShell Proficiency: Advanced skills in PowerShell scripting for automation and management and response actions.</li><li>Experience with cloud security (AWS, Azure, Google Cloud) and hybrid environments.</li><li>Windows/RHEL security knowledge- advantage</li><li>Familiar with CIS benchmarks/ hardening guidelines- Advantage</li><li>Can-do attitude, customer-facing, accountable, positive attitude, and time management skills.</li><li>Team player, confident, independent, and enthusiastic</li><li>Excellent communication skills &amp; excellent English (speaking, reading, and writing)</li><li><strong>Certifications (preferred)</strong>:</li><li>MS 365 Security certifications or equivalent to:</li><li>Certified Ethical Hacker (CEH)</li><li>Certified Information Systems Auditor (CISA)</li><li>Certified Cyber Threat Hunter (CCTH)</li><li>Certified Information Systems Security Professional (CISSP)</li><li>Offensive Security Certified Professional (OSCP)</li><li>Certified Expert in Threat Intelligence (GCTI)</li></ul><p><br></p><p><strong>What&#x200B; &#x200B;you&#x200B; &#x200B;will&#x200B; &#x200B;be&#x200B; &#x200B;part&#x200B; &#x200B;of:</strong></p><ul><li><strong>Company Overview -</strong><em> </em><u>https://www.stratasys.com/en/about-us/history/</u></li><li><strong>Our Culture and Values -</strong><em> </em><u>https://www.stratasys.com/en/about-us/culture/</u></li><li><strong>Our Sustainability &#x201C;3D Printing a Better Tomorrow&#x201D; </strong><em>-</em><strong> </strong><u>https://www.stratasys.com/en/about-us/sustainability/</u></li><li><strong>Our Locations </strong><em>-</em><strong> </strong><u>https://www.stratasys.com/en/contact-us/office-locations/</u></li><li><strong>Check out our Video - </strong><u>https://www.youtube.com/watch?v=6wmDfmt2bNI</u></li></ul><p></p>\n        </div>\n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--more\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\" aria-label=\"i18n_show_more\" aria-expanded=\"false\">\n<!---->\n        \n            Show more\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/cyolgscd0imw2ldqppkrb84vo\"></icon>\n    </button>\n  \n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--less\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\" aria-label=\"i18n_show_less\" aria-expanded=\"true\">\n<!---->\n        \n            Show less\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/4chtt12k98xwnba1nimld2oyg\"></icon>\n    </button>\n  \n<!---->    </section>",
    "base_salary": {
      "min_amount": null,
      "max_amount": null,
      "currency": null,
      "payment_period": null
    },
    "timestamp": "2024-12-22T09:41:18.608Z",
    "input": {
      "url": "https://il.linkedin.com/jobs/view/sr-cybersecurity-threat-intelligence-engineer-at-stratasys-4108012137"
    }
  },
  {
    "url": "https://www.linkedin.com/jobs/view/network-administrator-at-check-point-software-4088283914?lg=en",
    "job_posting_id": "4088283914",
    "job_title": "Network Administrator",
    "company_name": "Check Point Software",
    "company_id": "3090",
    "job_location": "Tel Aviv District, Israel",
    "job_summary": "Check Point Software Technologies is looking for a Network Administrator that will operate, maintain, and help to improve Check Point's growing network infrastructure. Why Join Us? You will be a part of the IT Infrastructure team responsible for the design, maintenance, and operation of a complex IT infrastructure. Key Responsibilities Responsible for technical operation and engineering of Check Point networks including hands-on implementation, monitoring and management of network infrastructure. Ensure uninterrupted network uptime for users and customers access across LAN, WAN and Wireless Networks within corporate infrastructure. Maintain high availability and continuous uptime for Data Center infrastructure and application services. Documenting and managing the installation of a new network environment, maintaining, and upgrading existing systems as necessary. Manage the day-to-day operations of the company’s network. Problems troubleshooting and resolving. Support the complicated LABs and improving the efficiency of network setups. This is an opportunity to be part of the team that is building a dynamic high­-performance networks and implementing cutting edge technologies. Must be able to share 24x7 support responsibilities for critical network segments. Qualifications 5 -7 years hands-on experience with large scale networks operation and architecture. Proven experience with: Cisco Nexus Line equipment. Cisco Catalyst line network equipment. Cisco ISR, ASR series routers. Load balancing technologies (Citrix NetScaler - an advantage). Wireless LAN technologies (Juniper Mist - an advantage). Cisco ISE experience (an advantage). Strong knowledge of complex networks (CCNP certification level). Experience working with Linux based servers and systems. Knowledge of virtualization infrastructure VMware/Nutanix. Excellent communication skills, customer oriented, including the ability to produce usable and maintainable documentation. Highly motivated team player. Proficient in spoken and written English. Self-Learning ability. Strong troubleshooting and analytical skills. Show more Show less",
    "job_seniority_level": "Mid-Senior level",
    "job_function": "Information Technology",
    "job_employment_type": "Full-time",
    "job_industries": "Computer and Network Security",
    "company_url": "https://www.linkedin.com/company/check-point-software-technologies?trk=public_jobs_topcard-org-name",
    "job_posted_time": "15 minutes ago",
    "job_num_applicants": 25,
    "discovery_input": {
      "url": "https://www.linkedin.com/jobs/search?keywords=Software&location=Tel%20Aviv-Yafo&geoId=101570771&trk=public_jobs_jobs-search-bar_search-submit&position=1&pageNum=0&f_TPR=r3600"
    },
    "apply_link": "https://www.linkedin.com/jobs/view/externalApply/4088283914?url=https%3A%2F%2Fcareers%2Echeckpoint%2Ecom%2Findex%2Ephp%3Fm%3Dcpcareers%26a%3Dshow%26joborderid%3D21972%26source%3D51%26mode%3Dclear&urlHash=x8bM",
    "country_code": null,
    "title_id": "150",
    "company_logo": "https://media.licdn.com/dms/image/v2/D560BAQGtqN8lHnC7WA/company-logo_100_100/company-logo_100_100/0/1698642229581/check_point_software_technologies_logo?e=2147483647&v=beta&t=TuHPCnsLtLq5JtiRtl5s4q1l1S2hGLQeU8bTfJmwYrQ",
    "job_posted_date": "2024-12-22T09:26:25.528Z",
    "job_poster": {
      "name": null,
      "title": null,
      "url": null
    },
    "application_availability": true,
    "job_description_formatted": "<section class=\"show-more-less-html\" data-max-lines=\"5\">\n        <div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          <p>Check Point Software Technologies is looking for a <strong>Network Administrator</strong> that will operate, maintain, and help to improve Check Point&apos;s growing network infrastructure.</p><p><br></p><p><strong>Why Join Us?</strong></p><p><br></p><p>You will be a part of the IT Infrastructure team responsible for the design, maintenance, and operation of a complex IT infrastructure.</p><p><br></p><p><strong>Key Responsibilities</strong></p><p><br></p><ul><li>Responsible for technical operation and engineering of Check Point networks including hands-on implementation, monitoring and management of network infrastructure.</li><li>Ensure uninterrupted network uptime for users and customers access across LAN, WAN and Wireless Networks within corporate infrastructure.</li><li>Maintain high availability and continuous uptime for Data Center infrastructure and application services.</li><li>Documenting and managing the installation of a new network environment, maintaining, and upgrading existing systems as necessary.</li><li>Manage the day-to-day operations of the company&#x2019;s network.</li><li>Problems troubleshooting and resolving.</li><li>Support the complicated LABs and improving the efficiency of network setups.</li><li>This is an opportunity to be part of the team that is building a dynamic high&#xAD;-performance networks and implementing cutting edge technologies.</li><li>Must be able to share 24x7 support responsibilities for critical network segments.</li></ul><p><br></p><p><strong>Qualifications</strong></p><p><br></p><ul><li>5 -7 years hands-on experience with large scale networks operation and architecture.</li><li>Proven experience with:</li><li>Cisco Nexus Line equipment.</li><li>Cisco Catalyst line network equipment.</li><li>Cisco ISR, ASR series routers.</li><li>Load balancing technologies (Citrix NetScaler - an advantage).</li><li>Wireless LAN technologies (Juniper Mist - an advantage).</li><li>Cisco ISE experience (an advantage).</li><li>Strong knowledge of complex networks (CCNP certification level).</li><li>Experience working with Linux based servers and systems.</li><li>Knowledge of virtualization infrastructure VMware/Nutanix.</li><li>Excellent communication skills, customer oriented, including the ability to produce usable and maintainable documentation.</li><li>Highly motivated team player.</li><li>Proficient in spoken and written English.</li><li>Self-Learning ability.</li><li>Strong troubleshooting and analytical skills.</li></ul>\n        </div>\n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--more\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\" aria-label=\"i18n_show_more\" aria-expanded=\"false\">\n<!---->\n        \n            Show more\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/cyolgscd0imw2ldqppkrb84vo\"></icon>\n    </button>\n  \n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--less\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\" aria-label=\"i18n_show_less\" aria-expanded=\"true\">\n<!---->\n        \n            Show less\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/4chtt12k98xwnba1nimld2oyg\"></icon>\n    </button>\n  \n<!---->    </section>",
    "base_salary": {
      "min_amount": null,
      "max_amount": null,
      "currency": null,
      "payment_period": null
    },
    "timestamp": "2024-12-22T09:41:25.545Z",
    "input": {
      "url": "https://il.linkedin.com/jobs/view/network-administrator-at-check-point-software-4088283914"
    }
  }
]