[
  {
    "input": {
      "url": "https://www.linkedin.com/jobs/view/4073552631"
    },
    "url": "https://www.linkedin.com/jobs/view/4073552631?lg=en",
    "job_posting_id": "4073552631",
    "job_title": "Data Platform Engineer",
    "company_name": "Cycode | Complete ASPM",
    "company_id": "40789623",
    "job_location": "Tel Aviv-Yafo, Tel Aviv District, Israel",
    "job_summary": "This is a unique opportunity to join an exciting early-stage startup experiencing hypergrowth in a white-hot segment of the cybersecurity space. Cycode is a fast-growing cybersecurity startup and the creator of the first comprehensive software supply chain security solution. As software supply chain attacks rise sharply, Cycode’s platform delivers complete visibility, security, and integrity across all stages of the software development lifecycle (SDLC), helping companies protect against high-profile threats. Founded in 2019, Cycode is backed by YL Ventures and Insight Partners and has received significant industry recognition, including Cyber Defense Magazine's Top Infosec Innovator (2023) and multiple other awards in recent years. As a Data Engineer at Cycode, you will play a pivotal role in shaping our evolving data culture. You will be responsible for collecting, organizing, and analyzing data to provide valuable insights that drive informed decision-making across the organization. This is an opportunity to join a dynamic team and contribute to the development of data-driven solutions that drive business growth and innovation. If you are passionate about data and thrive in a collaborative environment, we encourage you to apply. Responsibilities Collect and gather data from various sources, both internal and external. Organize and clean datasets to ensure accuracy and reliability. Utilize appropriate tools and software to analyze and visualize data effectively. Collaborate with cross-functional teams to identify data needs and requirements. Develop and implement data collection strategies to support business objectives. Interpret data and provide insights to inform decision-making processes. Create reports and presentations to communicate findings and recommendations. Assist in the development of data-driven solutions to address business challenges. Stay updated on industry trends and best practices in data analysis. Requirements: Bachelor's degree in a relevant field such as Statistics, Mathematics, Computer Science, or Economics. Strong analytical skills with the ability to collect, organize, and interpret large datasets. Proven experience in building, deploying, and monitoring of ETLs Proficiency in data analysis tools such as SQL, Python, Pandas, Apache Spark / Beam, etc Good understanding of data modeling principles Familiarity with data visualization tools such as Tableau, Power BI, or Google Data Studio. Excellent communication and collaboration skills. Ability to work independently and prioritize tasks effectively. Problem-solving mindset with a keen attention to detail. Experience in a data-related role is preferred but not required. Eagerness to learn and adapt to new technologies and methodologies. Advantages MongoDB AWS Cloud CICD, Docker Kubernetes Show more Show less",
    "job_seniority_level": "Not Applicable",
    "job_function": "Engineering and Information Technology",
    "job_employment_type": "Full-time",
    "job_industries": "Computer and Network Security",
    "company_url": "https://www.linkedin.com/company/cycode?trk=public_jobs_topcard-org-name",
    "job_posted_time": "1 month ago",
    "job_num_applicants": 85,
    "discovery_input": {
      "time_range": null,
      "job_type": null,
      "experience_level": null,
      "remote": null,
      "selective_search": null
    },
    "apply_link": "https://www.linkedin.com/jobs/view/externalApply/4073552631?url=https%3A%2F%2Fcycode%2Ecom%2Fcareers%2Fposition%2F%3Fpos_title%3Ddata-platform-engineer%26pos_id%3D53%2ED48%26coref%3D1%2E11%2Ep9D_4217&urlHash=c1hm",
    "country_code": null,
    "title_id": "6483",
    "company_logo": "https://media.licdn.com/dms/image/v2/D4D0BAQFsSsfzqEVWtw/company-logo_100_100/company-logo_100_100/0/1689682315729/cycode_logo?e=2147483647&v=beta&t=h91f6XM-5MGHa5FDhMCVtXy7Me0S8YQIPRAYUc4UVC0",
    "job_posted_date": "2024-11-22T09:41:10.107Z",
    "job_poster": {
      "name": null,
      "title": null,
      "url": null
    },
    "application_availability": true,
    "job_description_formatted": "<section class=\"show-more-less-html\" data-max-lines=\"5\">\n        <div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          This is a unique opportunity to join an exciting early-stage startup experiencing hypergrowth in a white-hot segment of the cybersecurity space.<br><br>Cycode is a fast-growing cybersecurity startup and the creator of the first comprehensive software supply chain security solution. As software supply chain attacks rise sharply, Cycode&#x2019;s platform delivers complete visibility, security, and integrity across all stages of the software development lifecycle (SDLC), helping companies protect against high-profile threats.<br><br>Founded in 2019, Cycode is backed by YL Ventures and Insight Partners and has received significant industry recognition, including Cyber Defense Magazine&apos;s Top Infosec Innovator (2023) and multiple other awards in recent years.<br><br>As a Data Engineer at Cycode, you will play a pivotal role in shaping our evolving data culture. You will be responsible for collecting, organizing, and analyzing data to provide valuable insights that drive informed decision-making across the organization. This is an opportunity to join a dynamic team and contribute to the development of data-driven solutions that drive business growth and innovation. If you are passionate about data and thrive in a collaborative environment, we encourage you to apply.<br><br><strong>Responsibilities<br><br></strong><ul><li>Collect and gather data from various sources, both internal and external.</li><li>Organize and clean datasets to ensure accuracy and reliability.</li><li>Utilize appropriate tools and software to analyze and visualize data effectively.</li><li>Collaborate with cross-functional teams to identify data needs and requirements.</li><li>Develop and implement data collection strategies to support business objectives.</li><li>Interpret data and provide insights to inform decision-making processes.</li><li>Create reports and presentations to communicate findings and recommendations.</li><li>Assist in the development of data-driven solutions to address business challenges.</li><li>Stay updated on industry trends and best practices in data analysis.<br><br></li></ul>Requirements:<br><br><ul><li>Bachelor&apos;s degree in a relevant field such as Statistics, Mathematics, Computer Science, or Economics.</li><li>Strong analytical skills with the ability to collect, organize, and interpret large datasets.</li><li>Proven experience in building, deploying, and monitoring of ETLs </li><li>Proficiency in data analysis tools such as SQL, Python, Pandas, Apache Spark / Beam, etc</li><li>Good understanding of data modeling principles</li><li>Familiarity with data visualization tools such as Tableau, Power BI, or Google Data Studio.</li><li>Excellent communication and collaboration skills.</li><li>Ability to work independently and prioritize tasks effectively.</li><li>Problem-solving mindset with a keen attention to detail.</li><li>Experience in a data-related role is preferred but not required.</li><li>Eagerness to learn and adapt to new technologies and methodologies.<br><br></li></ul>Advantages<br><br><ul><li>MongoDB </li><li>AWS Cloud </li><li>CICD, Docker Kubernetes</li></ul>\n        </div>\n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--more\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\" aria-label=\"i18n_show_more\" aria-expanded=\"false\">\n<!---->\n        \n            Show more\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/cyolgscd0imw2ldqppkrb84vo\"></icon>\n    </button>\n  \n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--less\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\" aria-label=\"i18n_show_less\" aria-expanded=\"true\">\n<!---->\n        \n            Show less\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/4chtt12k98xwnba1nimld2oyg\"></icon>\n    </button>\n  \n<!---->    </section>",
    "base_salary": {
      "min_amount": null,
      "max_amount": null,
      "currency": null,
      "payment_period": null
    },
    "timestamp": "2024-12-22T09:41:10.122Z"
  },
  {
    "input": {
      "url": "https://www.linkedin.com/jobs/view/4073729630"
    },
    "url": "https://www.linkedin.com/jobs/view/4073729630?lg=en",
    "job_posting_id": "4073729630",
    "job_title": "Data Engineer",
    "company_name": "Meta",
    "company_id": "10667",
    "job_location": "Tel Aviv-Yafo, Tel Aviv District, Israel",
    "job_summary": "As a Data Engineer at Meta, you will shape the future of people-facing and business-facing products we build across our entire family of applications (Facebook, Instagram, Messenger, WhatsApp, Reality Labs, Threads). Your technical skills and analytical mindset will be utilized designing and building some of the world's most extensive data sets, helping to craft experiences for billions of people and hundreds of millions of businesses worldwide.In this role, you will collaborate with software engineering, data science, and product management teams to design/build scalable data solutions across Meta to optimize growth, strategy, and user experience for our 3 billion plus users, as well as our internal employee community.You will be at the forefront of identifying and solving some of the most interesting data challenges at a scale few companies can match. By joining Meta, you will become part of a vibrant community dedicated to skill development and career growth in data engineering and beyond.Data Engineering: You will guide teams by building optimal data artifacts (including datasets and visualizations) to address key questions. You will refine our systems, design logging solutions, and create scalable data models. Ensuring data security and quality, and with a strong focus on efficiency, you will suggest architecture and development approaches and data management standards to address complex analytical problems.Product leadership: You will use data to shape product development, identify new opportunities, and tackle upcoming challenges. You'll ensure our products add value for users and businesses, by prioritizing projects, and driving innovative solutions to respond to challenges or opportunities.Communication and influence: You won't simply present data, but tell data-driven stories. You will convince and influence your partners using clear insights and recommendations. You will build credibility through structure and clarity, and be a trusted strategic partner. Data Engineer Responsibilities: Conceptualize and own the data architecture for multiple large-scale projects, while evaluating design and operational cost-benefit tradeoffs within systems Create and contribute to frameworks that improve the efficacy of logging data, while working with data infrastructure to triage issues and resolve Collaborate with engineers, product managers, and data scientists to understand data needs, representing key data insights in a meaningful way Define and manage Service Level Agreements for all data sets in allocated areas of ownership Determine and implement the security model based on privacy requirements, confirm safeguards are followed, address data quality issues, and evolve governance processes within allocated areas of ownership Design, build, and launch collections of sophisticated data models and visualizations that support multiple use cases across different products or domains Solve our most challenging data integration problems, utilizing optimal Extract, Transform, Load (ETL) patterns, frameworks, query techniques, sourcing from structured and unstructured data sources Assist in owning existing processes running in production, optimizing complex code through advanced algorithmic concepts Optimize pipelines, dashboards, frameworks, and systems to facilitate easier development of data artifacts Influence product and cross-functional teams to identify data opportunities to drive impact Mentor team members by giving/receiving actionable feedback Minimum Qualifications: Bachelor's degree in Computer Science, Engineering, relevant technical field, or equivalent 4+ years of experience where the primary responsibility involves working with data. This could include roles such as data analyst, data scientist, data engineer, or similar positions 4+ years of experience (or a minimum of 2+ years with a Ph.D) with SQL, ETL, data modeling, and at least one programming language (e.g., Python, C++, C#, Scala, etc.) About Meta: Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today—beyond the constraints of screens, the limits of distance, and even the rules of physics. Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta. Show more Show less",
    "job_seniority_level": "Not Applicable",
    "job_function": "Information Technology",
    "job_employment_type": "Full-time",
    "job_industries": "Technology, Information and Internet",
    "company_url": "https://www.linkedin.com/company/meta?trk=public_jobs_topcard-org-name",
    "job_posted_time": "2 weeks ago",
    "job_num_applicants": 200,
    "discovery_input": {
      "time_range": null,
      "job_type": null,
      "experience_level": null,
      "remote": null,
      "selective_search": null
    },
    "apply_link": "https://www.linkedin.com/jobs/view/externalApply/4073729630?url=https%3A%2F%2Fjsv3%2Erecruitics%2Ecom%2Fredirect%3Frx_cid%3D3239%26rx_jobId%3Da1KDp00000E2LWtMAN%26rx_url%3Dhttps%253A%252F%252Fwww%2Emetacareers%2Ecom%252Fjobs%252F1243470300203522%252F%253Frx_campaign%253DLinkedin1%2526rx_ch%253Dconnector%2526rx_group%253D126320%2526rx_job%253Da1KDp00000E2LWtMAN%2526rx_medium%253Dpost%2526rx_r%253Dnone%2526rx_source%253DLinkedin%2526rx_ts%253D20241222T001201Z%2526rx_vp%253Dslots%2526utm_campaign%253DJob%25252Bboard%2526utm_medium%253Djobs%2526utm_source%253DLIpaid&urlHash=ZsAf",
    "country_code": null,
    "title_id": "2732",
    "company_logo": "https://media.licdn.com/dms/image/v2/C4E0BAQFdNatYGiBelg/company-logo_100_100/company-logo_100_100/0/1636138754252/facebook_logo?e=2147483647&v=beta&t=yQdLB8_bCnLl5CaiAOcOMFm39fvGboZVNBYTqgRVKWg",
    "job_posted_date": "2024-12-08T09:41:14.309Z",
    "job_poster": {
      "name": null,
      "title": null,
      "url": null
    },
    "application_availability": true,
    "job_description_formatted": "<section class=\"show-more-less-html\" data-max-lines=\"5\">\n        <div class=\"show-more-less-html__markup show-more-less-html__markup--clamp-after-5\n            relative overflow-hidden\">\n          As a Data Engineer at Meta, you will shape the future of people-facing and business-facing products we build across our entire family of applications (Facebook, Instagram, Messenger, WhatsApp, Reality Labs, Threads). Your technical skills and analytical mindset will be utilized designing and building some of the world&apos;s most extensive data sets, helping to craft experiences for billions of people and hundreds of millions of businesses worldwide.In this role, you will collaborate with software engineering, data science, and product management teams to design/build scalable data solutions across Meta to optimize growth, strategy, and user experience for our 3 billion plus users, as well as our internal employee community.You will be at the forefront of identifying and solving some of the most interesting data challenges at a scale few companies can match. By joining Meta, you will become part of a vibrant community dedicated to skill development and career growth in data engineering and beyond.Data Engineering: You will guide teams by building optimal data artifacts (including datasets and visualizations) to address key questions. You will refine our systems, design logging solutions, and create scalable data models. Ensuring data security and quality, and with a strong focus on efficiency, you will suggest architecture and development approaches and data management standards to address complex analytical problems.Product leadership: You will use data to shape product development, identify new opportunities, and tackle upcoming challenges. You&apos;ll ensure our products add value for users and businesses, by prioritizing projects, and driving innovative solutions to respond to challenges or opportunities.Communication and influence: You won&apos;t simply present data, but tell data-driven stories. You will convince and influence your partners using clear insights and recommendations. You will build credibility through structure and clarity, and be a trusted strategic partner.<br><br>Data Engineer Responsibilities:<br><br><ul><li>Conceptualize and own the data architecture for multiple large-scale projects, while evaluating design and operational cost-benefit tradeoffs within systems</li><li>Create and contribute to frameworks that improve the efficacy of logging data, while working with data infrastructure to triage issues and resolve</li><li>Collaborate with engineers, product managers, and data scientists to understand data needs, representing key data insights in a meaningful way</li><li>Define and manage Service Level Agreements for all data sets in allocated areas of ownership</li><li>Determine and implement the security model based on privacy requirements, confirm safeguards are followed, address data quality issues, and evolve governance processes within allocated areas of ownership</li><li>Design, build, and launch collections of sophisticated data models and visualizations that support multiple use cases across different products or domains</li><li>Solve our most challenging data integration problems, utilizing optimal Extract, Transform, Load (ETL) patterns, frameworks, query techniques, sourcing from structured and unstructured data sources</li><li>Assist in owning existing processes running in production, optimizing complex code through advanced algorithmic concepts</li><li>Optimize pipelines, dashboards, frameworks, and systems to facilitate easier development of data artifacts</li><li>Influence product and cross-functional teams to identify data opportunities to drive impact</li><li>Mentor team members by giving/receiving actionable feedback<br><br></li></ul>Minimum Qualifications:<br><br><ul><li>Bachelor&apos;s degree in Computer Science, Engineering, relevant technical field, or equivalent</li><li>4+ years of experience where the primary responsibility involves working with data. This could include roles such as data analyst, data scientist, data engineer, or similar positions</li><li>4+ years of experience (or a minimum of 2+ years with a Ph.D) with SQL, ETL, data modeling, and at least one programming language (e.g., Python, C++, C#, Scala, etc.)<br><br></li></ul>About Meta:<br><br>Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world. Now, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today&#x2014;beyond the constraints of screens, the limits of distance, and even the rules of physics.<br><br>Individual compensation is determined by skills, qualifications, experience, and location. Compensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about  benefits  at Meta.\n        </div>\n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--more\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-more-html-btn\" aria-label=\"i18n_show_more\" aria-expanded=\"false\">\n<!---->\n        \n            Show more\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/cyolgscd0imw2ldqppkrb84vo\"></icon>\n    </button>\n  \n\n        \n\n    \n    \n    \n\n    <button class=\"show-more-less-html__button show-more-less-button\n        show-more-less-html__button--less\n        ml-0.5\" data-tracking-control-name=\"public_jobs_show-less-html-btn\" aria-label=\"i18n_show_less\" aria-expanded=\"true\">\n<!---->\n        \n            Show less\n          \n\n          <icon class=\"show-more-less-html__button-icon show-more-less-button-icon\" data-delayed-url=\"https://static.licdn.com/aero-v1/sc/h/4chtt12k98xwnba1nimld2oyg\"></icon>\n    </button>\n  \n<!---->    </section>",
    "base_salary": {
      "min_amount": null,
      "max_amount": null,
      "currency": null,
      "payment_period": null
    },
    "timestamp": "2024-12-22T09:41:14.335Z"
  }
]